{
  "url": "https://www.youtube.com/watch?v=0CGHwukCwpA",
  "video_id": "0CGHwukCwpA",
  "video_title": "Breakfast, Lunch & Dinner Microwave Hacks | Marion's Kitchen",
  "channel": "Marion's Kitchen",
  "transcript": "Perfectly poached eggs and crispy bacon, homemade chili crisp made in like the quickest time and peanut, saute, chicken noodles. All of that is made in my microwave. Now I'm going to be making breakfast, lunch, and dinner, but this episode is not just about recipes. It's about actual hacks. Like how do you get the crispy bacon without all the mess on the stove top poached eggs that actually look and taste good. Chili crisp that you make in the microwave that is so easy and finally how to use that convection mode in your convection microwave oven to actually cook things faster. In this episode I'm going to be using my Panasonic 3-in-1 convection microwave oven. It does baking, grilling, microwaving and it also is going to make all of this delicious food today. There are a couple of things here that are going to blow your mind. One is how do you make poached eggs without all the fuss. Now I know I'm a poached egg girl when I go out for breakfast right, but I hardly ever make them at home. Sherry, do you like poached eggs? Do you make them at home? No I don't. Okay. Case in point, okay, because it's hard, it's messy and sometimes you just don't want to deal with that in the morning, the risk of the eggs not working out. I'm going to show you how you can do this in like five minutes flat. Now the preparation here is a little important. So first of all I've got my egg and then I've got just over a half a cup of water here. I'm going to put the water in first. And the point here is that I want to slide the egg in so it sits underneath the water rather than on top. So I'll show you what I mean. So just tilt the cup, pull that egg in and the egg is now sitting underneath the water. Now we go into our microwave. Place a plate on top to act as a lid and then microwave for 30 seconds. Stop there, take the plate off just so you can give the egg a little time to cool down for just like two seconds. Place the plate back on and then microwave for another 30 seconds or until the egg is poached just to your liking. Okay, let's have a look. All right, that looks so perfect. Such a great texture. So easy as well. Oh, look at that. It's all jiggly. It's such a nice shape as well. Sometimes I find when you're approaching eggs in a pot, you get you know, you can get wild shapes and the egg white goes everywhere. So I really love that. And then if we just open this up, look at that. Perfect. So good. Ah, okay, bacon first before I get into eating my egg. For the bacon, use a plate that's lined with plenty of paper towel. Place the bacon around the edges of the plate. This ensures it cooks more evenly and then place another plate on top and microwave at 600 watts. So not full power. Bring it down to 600 watts for four minutes. Moisturise. Moisturise. Ta-da! Look at that crispy bacon. Okay, this is great. Zero mess on my stove top. I am very, very happy. Breakfast is only added away. Okay. I have my egg. Oh, that's a good one. Look at that. Bacon. And there you go. I mean, okay, for like a few minutes, no mess. Just the microwave. I think that is really incredible. In fact, I'm so hungry. Bacon just makes you hungry. Let's have a look in here. Look at this egg. Ah, yes. So good. And the bacon. See how crispy it is. So good. Great. I mean, I just think using the microwave for those sorts of hacks is really actually quite life changing. So good. Should we do lunch? Let's do lunch. One of my all time favorite microwave hacks is actually using it to crisp things up in oil. So think fried garlic like crispy little slices. And when you do it on the stove top, it can burn really easily. So much easier in the microwave. Let me show you. I'm going to be using my crispy garlic to make the most amazing chili crisp oil. So the microwave just makes the whole process quicker and easier. To start the chili crisp, I want to make the garlic oil. So add one cup of vegetable oil into a glass jug or microwave safe bowl and place your sliced garlic into the oil. Place it into the microwave and cook for three minutes or until it's just sizzling and like a pale golden color because it will continue to cook in that oil as it sits. So much easier than heating the oil. The oil being too hot or too cold when you put the garlic in and possibly burning it. That is just such a great hack. Okay, so chili crisp. I'm going to need some flaky chili. So these are this is dried chili that I bought. It's kind of like crushed from the Asian supermarket, but you could get whole chilies and whizz them up in the blender to get the same kind of texture. Just kind of want a rough texture, not too powdery. Some crispy fried shallots, which you could also make in the microwave. Spices. We've got star anise and green cardamom pods here. Ginger. That's just some fresh chopped ginger, salt, sugar. Now our hot oil and the garlic. Now because there is raw ginger and fresh garlic in this chili crisp oil, I do like to keep it in the fridge for up to a week or two weeks. Now to show off my chili crisp oil, I'm actually going to make a really easy soup. It's cauliflower and fennel. To make the soup, thinly slice your fennel and place it into a large microwave safe bowl. Add in the cauliflower, some sliced onions, some cashew nuts that have just been lightly toasted, some fresh thyme leaves, one dry bay leaf, some sea salt, some pepper, a chicken stock cube. Now I've just lightly crushed this so it's like nice and soft. And then add in your liquid. I've got water and milk here. Now my one big tip here for whenever you want to cook a vegetable through is to make sure that it's completely covered with the liquid. So I've still got some cauliflower poking up there. I'm going to add a little bit more milk. Place a lid on top. And microwave using full power. That's 1000 watts for about 10 to 12 minutes or until the vegetables are really soft and tender. Alright, so the microwave's doing its thing. So I'm just going to talk a little nerd factor here. The Panasonic Convection microwave actually has what's called inverter technology. Now I've talked inverter technology before. Dax, can you remember what it is? I can help quiz. What is it? Let's do a throwback. It's a throwback as a cheat. Inverter technology means that in the Panasonic microwave the power actually regulates. So it can operate at a medium sort of power level to cook things through evenly. If you don't have inverter technology your microwave just goes on off, on off, on off. So you get a more even heat distribution when you have inverter technology. Cook everything more evenly. Science. Science. Technology. It's a winner. Carefully take that bowl out of the microwave. It's going to be really hot. So just be careful here. And then what I want to do is kind of separate the vegetables in the liquid. I also want to make sure I take that dried belly fat because that will not blend up very nicely. Now start loading up your blender. I find that it's easier to blend in two batches so you don't overload your blender. So I have got half the vegetable mixture here and I've just filled up the liquid just so it covers that and then I'm going to blend. Okay, let's have a look in here. Oh, looks so nice and creamy. Love this. Now to sully the whole situation with some beautiful chili crisp. Wow, look at that color. So nice. Extra chili crisp on the side, but a toast and we are good for lunch, my friends. Look at that. So good. I love this chili crisp oil hack. It's one of my favorites. Let me get in here and try some of this. That is just divine. Love, love, love. Dinner. I'm going to make dinner now. Okay, so we now have quite a few little life hacks under our belt for the actual microwave part of the microwave. But now I want to talk about another really underutilized function of conviction microwaves and that's the conviction part. So if you use your microwave, like I use my Panasonic Convection microwave and use the combination power, which is microwave and grilling or microwave and roasting, you actually save time. So I'm going to be able to grill my chicken in 12 minutes flat and it's going to be done perfectly cooked through. And I don't have to worry if the chicken is cooked or raw in the middle because it will be beautifully cooked. And then I'm going to turn that chicken into the most wonderful, fresh, amazing, beautiful, saute chicken noodle bowl. All right, let's do the chicken first. I've got chicken thighs because you know me. I am all legs and thighs. You know what I mean. Okay, some garlic here as well. Need some turmeric, salt and some oil. This is like my standard Thai saute chicken marinade that I like to use. Now if you wanted to put this on skewers and grill those in your convection microwave, you could do that as well. I'm just going to place it all out onto a plate because it's just so much easier and I don't have to get my fingers dirty then. I'm just going to leave that for a few minutes just while I make my saute sauce. Now I just love how quickly this saute sauce comes together. I'm just going to put everything in a bowl, mix it and put it in the microwave. Peanut butter, red curry paste, coconut cream, fish sauce, sugar, just a little water here as well. Bring that together. This just goes into the microwave for two minutes. Oh, that color nice. So just give us a little bit of a mix here and look at that color. I love that. Now I don't want this to be too thick because I want to be able to kind of loosen my noodles with this sauce. Now that looks pretty perfect to me. Ah, it's like the easiest saute sauce ever. To do your noodles in the microwave, just add them into a large microwave safe bowl. Cover with water and then cook for 10 minutes or 12 minutes depending on how thick your noodles are. Cook them until they're tender, drain and then rinse them in tap water so they're cool to the touch. Now we're back to the chicken. So what I'm going to do is spread this chicken out onto a plate. Now if you have a convection microwave at home, this is a really great way to do chicken dishes. To do chicken very quickly, typically with my panasonic microwave anyway, I have a little stand here which brings the chicken up closer to where the grill heat sources. So I can get really nice, lovely sort of gold and chicken color. Now the whole point of doing it like this instead of doing it on your stove top is really just convenience. This is the kind of thing where you know you just want to get it done quickly with as little mess as possible. And so you utilize technology. Alright, now I'm going to pop this in. And here's the thing. So the combination is the key. I'm going to do grill but also microwave so that the grill cooks and chars on the outside, the microwave cooks through the center and that's how you get things cooking faster. So all I need here is just 12 minutes and my chicken will be done and we can build our bowl. Ooh, that smells good. Let's open it up and have a look. Look at that. No mess, you can just pop it in, go away, do what you need to do with the kids or whatever and the chicken is just done. Sometimes you just need convenience factor. Okay, some chicken here. Now some of our sate sauce. A little bit around the plate. And I like to add a bit of freshness here at the end so I've just got some cucumber. Obviously you could just do chunks of cucumber. I'm being a little fancy because I want to make it look beautiful. But if you're doing this for a weeknight, feel free to just do the chunks. Okay, some herbs, I've got some coriander. If you happen to have it, some Thai basil is very nice here as well but not a deal breaker obviously. And then a little smattering of chili because would it be a merry dish without just a little bit of spice? So there you have it. My dinner made completely in the microwave and I think there's a lot of really good tips in this chicken noodle recipe. Like how to cook your noodles in the microwave, doing a really quick sate sauce and then again utilizing that convection function if you do have it. People often forget that that can make things quicker. But without further ado, I'm just going to get in here and eat because my goodness that chicken smells amazing. Oh, that chicken. So good. And the sate sauce. Wow. I mean, if this is a convenience dinner, I am all for it. Here you go, Dax, breakfast, lunch and dinner. Oh, yaga. All in one day. Thank you, Penicillin. Thank you. Thank you, microwave. My friend. Bacon for you. Is that good? Yeah, we need some too. Mmm, yum. You love bacon. You're a little bacon-feent, I don't know.",
  "recipe": {
    "title": "Microwave Breakfast, Lunch, and Dinner Hacks",
    "ingredients": [
      "Egg",
      "Water",
      "Bacon",
      "Paper towel",
      "Vegetable oil",
      "Sliced garlic",
      "Flaky chili",
      "Crispy fried shallots",
      "Star anise",
      "Green cardamom pods",
      "Fresh chopped ginger",
      "Salt",
      "Sugar",
      "Cauliflower",
      "Fennel",
      "Sliced onions",
      "Cashew nuts",
      "Fresh thyme leaves",
      "Dry bay leaf",
      "Chicken stock cube",
      "Chicken thighs",
      "Garlic",
      "Turmeric",
      "Oil",
      "Peanut butter",
      "Red curry paste",
      "Coconut cream",
      "Fish sauce",
      "Water",
      "Noodles"
    ],
    "steps": [
      "Add just over a half a cup of water to a cup.",
      "Tilt the cup and slide the egg in so it sits underneath the water.",
      "Place a plate on top and microwave for 30 seconds.",
      "Remove the plate, let the egg cool for 2 seconds, then replace the plate.",
      "Microwave for another 30 seconds or until the egg is poached to your liking.",
      "For bacon, line a plate with paper towel and place bacon around the edges.",
      "Cover with another plate and microwave at 600 watts for 4 minutes.",
      "For chili crisp, add 1 cup of vegetable oil and sliced garlic to a microwave-safe bowl.",
      "Microwave for 3 minutes or until the garlic is sizzling and pale golden.",
      "Add flaky chili, crispy fried shallots, spices, ginger, salt, and sugar to the garlic oil.",
      "For soup, thinly slice fennel and place in a large microwave-safe bowl.",
      "Add cauliflower, sliced onions, cashew nuts, thyme, bay leaf, salt, pepper, and chicken stock cube.",
      "Cover with water and milk, ensuring vegetables are submerged.",
      "Microwave at full power for 10 to 12 minutes until vegetables are soft.",
      "Blend the soup in batches until creamy.",
      "For chicken, marinate chicken thighs with garlic, turmeric, salt, and oil.",
      "Spread chicken on a plate and microwave using convection mode for 12 minutes.",
      "Prepare sauté sauce by mixing peanut butter, red curry paste, coconut cream, fish sauce, sugar, and water in a bowl.",
      "Microwave the sauce for 2 minutes.",
      "Cook noodles in a large microwave-safe bowl covered with water for 10 to 12 minutes until tender.",
      "Drain and rinse noodles with tap water.",
      "Assemble the chicken noodle bowl with chicken, sauté sauce, cucumber, herbs, and chili."
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": null,
    "tools": [
      "Microwave",
      "Plate",
      "Glass jug or microwave-safe bowl",
      "Blender"
    ]
  }
}