{
  "url": "https://www.youtube.com/watch?v=4pONXNJMlXY",
  "video_id": "4pONXNJMlXY",
  "video_title": "Ultimate Vietnamese Bun Cha Recipe: Chargrilled Pork Belly & Vermicelli Noodles",
  "channel": "Marion's Kitchen",
  "transcript": "Wow, I wish you guys were here to smell this. Oh. I will happily admit to being barbecued obsessed. And actually one of the ways I love to barbecue is using charcoal and my firehawk grill. One of the reasons I love this style of barbecue is that it brings that beautiful like street food Asian charcoal flavor to whatever I'm cooking. And in particular this dish really needs that beautiful charcoal pork flavor. Now I think there's a big misconception that cooking with charcoal is really difficult, but it's really not when you've got the right information. So let me show you how I set up my grill. It's very easy. Take your grill plates out. And really there are kind of four main elements I think to a charcoal barbecue you need to know about. One is this top vent here which is going to control some of your heat. Another way to control heat is this vent down here. The other part is obviously in here where we light the charcoal. So I'm going to do that part now. I like to start off with some paper towel. Some violators. Then the basket goes in. Now the fire basket sits in a ceramic base inside the firehawk and it's that ceramic base that really holds the heat and is the kind of core of your barbecue if you like. One more thing that's really great about these barbecues is this mesh heat lock seal. So that also helps with temperature control and keeping all of the moisture inside as well. So there are some basics. I'm going to go through a little bit more about cooking zones later on. But let's get the charcoal in and light it up. While my barbecue is heating up over here I've got plenty of time to do my marinade and my dressing. So the star of the show when it comes to buncha is the pork. And I'm doing two different types. I'm going to do a pork patty with my mints and a really beautiful marinated pork belly. And I think this really showcases two styles of things that you can do with a charcoal grill like your firehawk. Because you can be doing little patties, you can be doing strips of meat and the charcoal flavor on all those things is so good. Now the marinade itself is very simple. I've got some fish sauce, sugar and I use the same marinade for both cuts of meat so I'm saving time. Some dark soy sauce, schlutz, garlic and a little sprinkling of black pepper. Now one great tip here is that a fish sauce or a soy sauce marinade does not take very long. So I'll often just do this right before I barbecue. You can leave it for an hour or so if you've got the time but don't worry if you don't. First up I'm going to take my pork mince, half my marinade. I'm going to say for a barbecue grill patty these kinds of cuts are so economical and budget friendly. You can really make this stretch a long way which I really love as well. Okay, mix all of that together. At this point I'm going to get messy with my hands. Just a little sprinkling of water will make things less sticky. And just give that a little bit of a need. You're kind of like mixing the protein so they become stickier. Because of course we don't have any binding agents here. There's no egg or anything. It's just my marinade and the fork. This is the Asian mother way of tuffing up the pork meatball. You're like, you know, I'm sure there's something scientific in it but it just firms up the meatball. That's what it does. Now I just take kind of a heat table spoons of this pork mixture and form some loose little patties. I like to keep it kind of rustic here. So at this point I want to check in to see what my charcoal's doing. Okay, so this is pretty much perfect. This is how you know that you're ready to cook all the big flames of dye down now. Charcoal's starting to turn white. So I'm going to get my grill plates in. The cool thing about your fireholt grill is that it comes with these deflector plates. Now deflector plates are the unsung hero of the charcoal barbecue because they actually deflect the heat and make it go up and around inside. And that way you don't get too many fat fires burning your food. It really is a genius way to stop those sorts of things happening and it doubles as a pizza stone. And my grill goes on top of that. I'm going to use this bottom grill area. You can also do multi-level grilling. So if you wanted to pull meats out and go from here to here, you can do that as well. But I'm just going to go right down in here this time because I want to use this other accessory which is my cast iron grill plate. This is such a game changer if you are doing it little small delicate pieces like our pork patties. Also great if you want to get a really good kind of like char on steaks or anything like that as well. But I'm going to use it now because I've got smaller pieces that I don't want to fall through the grill and get that heating up. For your dipping sauce you need sugar, fish sauce, white vinegar, water, some lime juice, some chopped red chili and some chopped garlic. So it's time to start grilling and one of the things I love about my fire hawk is you've got the temperature thermometer here which actually says smoking, barbecue roasting, searing, it tells you what to do. And then I've left the vents here open. This is how you control the temperature. So I've left it right open here which gives us the maximum amount of heat. We'll also left this vent open and that's why I get my cast iron grill really hot. Now the cool thing about this accessory is that you get the cast iron sear but you also get the charcoal flavor. I like it. You can tell I'm excited. Okay to prepare this I just want to dip some oil in here. Now just like any kind of cast iron grill. I just want to give that a little bit of an oil. I just use a plain vegetable oil here or a peanut oil. And now my little pork patties can go on. Got to have that sound. It's literally like my happy place. And now the pork belly. So these are just strips of pork belly. I think people often think with pork belly that you have to cook it low and slow but actually you can grill it fast on the barbecue as well and it will still be lovely and tender. Not full apart tender like a slow cooked pork belly but beautiful char and still a tender tender bite. Cook them until they're just cooked through and lovely and charred on the outside. You probably need about five or four minutes each side for the patties and about four minutes each side for the pork belly. Wow I wish you guys were here to smell this. Ah the charcoal and the soy sauce and the garlic and that grilled pork belly aroma. My goodness. Literally mouth watering. So these are our lovely little meat patties. And even though these look so delicious there's just one thing you cannot experience through the screen and that is the flavor that this kind of cooking in parts. Ah I'm so ready for dinner my goodness. Now the way I like to serve this is in a rather traditional style. So what we do is we have all these beautiful fresh greens and herbs. I've chosen some Thai basil and mint here and then some lovely buncha noodles. So these are like Vietnamese rice noodles. So we get our pieces of pork. The patties go in here. Slice up the pork belly. I mean I'm just going to be able to help with that. Angel singing. It is so good and so tender my goodness. Wow. Tell you what if you have never charcoal grilled pork belly you have not lived. Now the pork belly. And now you actually get the dressing and pour that over the top. And what happens is all of that delicious charred porky goodness goes into that dressing and that becomes the most amazing sauce for your noodles and your lettuce and herbs. I grab some noodles and then I like to take bits of my pork. And you definitely want some of this dressing. And then you just kind of like picking cheese little bits and pieces. I love this style of eating it so fresh and lovely. Some mint and basil. And that my friends is such a beautiful bowl. So fresh and lovely. Wow.",
  "recipe": {
    "title": "Charcoal Grilled Pork Belly and Patties",
    "ingredients": [
      "pork mince",
      "pork belly",
      "fish sauce",
      "sugar",
      "dark soy sauce",
      "garlic",
      "black pepper",
      "water",
      "vegetable oil or peanut oil",
      "sugar (for dipping sauce)",
      "white vinegar",
      "lime juice",
      "chopped red chili",
      "chopped garlic",
      "Thai basil",
      "mint",
      "buncha noodles"
    ],
    "steps": [
      "Set up the charcoal grill and light the charcoal.",
      "Prepare the marinade with fish sauce, sugar, dark soy sauce, garlic, and black pepper.",
      "Mix half the marinade with the pork mince and form into loose patties.",
      "Check the charcoal; it should be turning white and ready to cook.",
      "Place grill plates and deflector plates in the grill.",
      "Heat the cast iron grill plate with a little oil.",
      "Place the pork patties and strips of pork belly on the grill.",
      "Cook the patties for about 4-5 minutes on each side and the pork belly for about 4 minutes on each side.",
      "Prepare the dipping sauce with sugar, fish sauce, white vinegar, water, lime juice, chopped red chili, and chopped garlic.",
      "Serve the grilled pork with fresh greens, herbs, and buncha noodles, drizzled with the dressing."
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": "Vietnamese",
    "tools": [
      "charcoal grill",
      "firehawk grill",
      "cast iron grill plate",
      "deflector plates"
    ]
  }
}