{
  "url": "https://www.youtube.com/watch?v=_qgMTurPOWE",
  "video_id": "_qgMTurPOWE",
  "video_title": "My Picnic Favourites: 6 Recipes to take out to eat | Marion's Kitchen",
  "channel": "Marion's Kitchen",
  "transcript": "Crispy, crumbed pork cutlets sandwiched with a Japanese barbecue sauce and fluffy white bread. This is the ultimate pork sandwich. It's katsu sando. Okay so I am all about crispy crunchy things in sandwiches. What could be better? So we are going to do a crumbed pork version today in a very Japanese style. So the first thing we're going to do though is just this little tiny trick that's going to keep your pork really moist and that is to dry-brain it. So I'm going to sprinkle my pork and what I've got here is just some pork loin cutlets. They're around about one centimeter, one and a half centimeters thick so they're quite thin. We're going to do a double pork sandwich so I'm going to double these guides up so I don't want them too thick. Now dry-solting or dry-braining so I'm going to sprinkle these very liberally with some salt and you would have heard of wet braining so this is a similar thing but a little quicker and we're just going to do it with the dry salt. So turn these over and make sure we get salt on all sides and then what I want you to do is be a little bit patient and leave these guides for at least 15 minutes, 15 or 20 minutes and come back and I'll show you how our pork is transformed. Okay so if we have a look you can see the salt has dissolved which means we've gone some way to getting a little bit of that saline water into our pork, keeping them juicy and keeping them perfectly seasoned. Okay so that is our first step for getting the ultimate fried pork cutlet. The second part is we're going to do our crumbing so I have a regular crumbing stations that are here, flour, I want some eggs, just give this a whisk. Now I prefer the dry-hand wet hand situation when I'm crumbing that keeps my fingers a little bit cleaner than they would if I just went in there with both hands so grab my pork with my wet hand and then use my dry hand to get the flour spread out all over. Okay, shake off the excess into my egg and then your wet hand comes along and douses everything in the egg. Okay, allow that to trip off and then into your panko bread crumbs. So these are Japanese style bread crumbs, I love them, they're really nice and light and crispy and fluffy and you can find them in the Asian section of most supermarkets these days. Okay and there we go there's one of our pork cutlets done now onto the rest. Okay now I've got some hot oil around about sort of a centimeter deep in my pan, it's gonna get my pork cutlet straight in there. Now I just want to gentle sizzle here, I don't need to be too harsh because I want a really beautiful even golden color and I want to make sure the pork cooks through as well. Now after just a minute or so I'm going to flip these guys over. They're not quite ready on that first side but what I want to do is keep flipping them over from time to time to make sure that we're getting that even golden color. I just let them sit in the one spot in the pan, tend to get kind of little brown hot spots on your cutlets. Okay and again cooking them over. So once you have a beautiful golden brown even color take them out and drain them on paper towel and as with anything that comes out of the hot oil I like to season with a bit more salt not too much because they are beautifully seasoned inside our little pork cutlets and so now we come to the sandwich part. Now I'm really lucky because here in Bangkok I live right near a Japanese bakery so I can find this beautiful thick fluffy Japanese style bread. If you've got a Japanese supermarket nearby head there and see if they've got some beautiful bread otherwise just go for a really thick cut white toast size bread. Okay so put that down and I just want a little bit of butter edge to edge. Very particular about my sandwich construction and now here's one essential condiment this dish and that is Japanese Tonkatsu sauce and it's basically like to me a Japanese version of barbecue sauce that's what it tastes like and it has the most amazing sweet tangy flavor you can find it in a lot of major supermarket now in the Asian section all from your Japanese grocer and I want a very liberal dicing of that bread. Okay now just spread that out and what should happen here is the bread and some of the crumming on the pork cutlets will soak up some of this sauce and get really nice and tasty. Now I like to add a little bit of shaved cabbage just on the bottom and now time for our pork cutlets. So one piece on there and then this is totally not traditional katsu sando but I am going to add a double layer of the pork today just because I can. I'm going to put a little bit more sauce onto that first cutlet add my second cutlet so over the top I love it. Okay and then I want to finish off with another slice of bread put some butter on there and we need more sauce and now because traditionally a Japanese katsu sando would be a little bit squished doesn't sound great but that's kind of the word but what I want to do is put a tray on top here I've got a couple of bowls on to weight it down and we're just sort of pushing down a little bit and I'm just going to leave this for a few minutes so that the bread the whole cutlets the sauce everything pushes together into a firm block and now here we are guys at the beautiful moment of truth I'm going to take that off and lift up our sandwich and I'm going to cut the crust off on the sides now don't worry about those bits I will be sure to taste test them once we've done filming that's a very nice cook's treat so now we have a nice neat rectangle the perfect restaurant style shape for our sando and I'm going to cut this into thirds and let's have a look I love it beautiful crispy pork barbecue sauce okay so just wet my knife under there and serve that up and I've just got a little dollop of hot mustard there I like to kind of spread that on or dip my sandwich and that as I'm eating it and then I want a little bit of cabbage on the side there and then we have it guys a totally ultimate crispy pork sandwich that restaurant style Japanese katsu sando and I'm going to have to taste test obviously because you know two tastes do not do something about the way the sandwich is constructed the sauce the crispy pork even the crunchy cabbage it is all just perfect the ultimate chunky chocolate peanut butter did I say chocolate cookie this guy is so loaded and yeah there's like a few little secret ingredients here these are my chalk peanut butter craft cookies I've literally eaten like 50 of these and I still love them I'm a goodness we have to get these out of our lives we've got to get rid of them don't make any wall we can't make any wall all right these cookies are like so loaded with so much stuff and we have literally been testing them for weeks haven't we guys have we been testing the police I've literally eaten so many of these but the good news is that we now have the perfect recipe just for you so let's get into this recipe shall we first off we want some butter now we need a mix here of brown sugar and some pasta sugar now we want to mix this until everything is welcomed blind and kind of creamy like it so once things are looking a bit like this then you just want to scrape everything down now we go in with some fun things the start of the fun things first of all some miso paste so this is gonna add a little salty kind of kick to everything which just makes things so much more yum I think all right so miso goes in and some peanut butter now I'm a crunchy kind of girl so you can go smooth I like crunchy are you smooth or crunchy let me know that's a you smooth or crunchy what do you are crunchy your crunchy all the way hailey crunchy all the good people like crunchy okay give this a mix okay so once things are looking like they're very well mixed in there just scrape that bowl down again now we need an egg and just another little hit of salt so you know obviously I don't want this to be overly salty but I think when you add that extra element of salt to sweet things you really I don't know like it accentuates the sweetness it accentuates all the flavors so yeah I mean I really like it salty the chocolate the peanut butter it all works so well okay give that another mix okay so we're gonna go with some flour here now I'm using a low protein or what might be known as a cake or cookie flour which you can find in your baking section the soup market look that's just gonna give you like a lighter crispy kind of cookie but if you've just got all purpose or plain flour that's cool as well now what I do want to do is just get a third about a third of that flour in first and I'm gonna mix that in and that's gonna help to keep things nice and smooth and not get those lumpy floury bits okay so now we can add in the baking powder and the rest of our flour I tell you what like this is already smelling so good like the peanut and the yum okay so let's grab this out now we can add in even more fun stuff okay I have got some chocolate here and I would rather if you could use some nice big blocks of chocolate because I do want nice big chunks of this rather than sort of like small little chalk chips now I'm using dark chocolate today but you could do a little chocolate if you want to okay chocolate goes in next up chopped roasted peanuts just fold that in so it's like there's more chocolate and peanuts than cookie dough are there sort of problem oh my goodness it smells so good okay cookie dough is ready to go I'm gonna go in here with an ice cream scoop because it's easy and fun you could just get in here actually with your hands and just roll some little balls of the cookie dough but I mean look at that it's like scooping ice cream but it's cookie dough okay so these need to go on the fridge 15 minutes just to chill down a little bit until we move on to the next part because we're not finished with these guys yet it's more things to come okay so these are out of the fridge they're ready to go and you're gonna think I'm a little crazy but we're gonna do like a cookie crumbing station here trust me this is gonna be a big alright okay so first of all I'm gonna get some my peanuts into a little plate here so these are just more chopped roasted peanuts I've got some dark chocolate here and I have some more peanut butter so I'm gonna get a little scoop of peanut butter and just smear that onto the top of each of these little ice cream balls of cookie dough okay so here's how this goes grab yourself a little ball of cookie dough sprinkle over some chocolate on the top some chocolate now into your peanuts roll that around woohoo look at that that is one loaded ball of cookie dough okay keep going don't eat all that cookie dough although it is really good to eat I mean really what you should be doing is like saving half the cookie dough putting it into my ice cream okay so these are ready to go I've got my oven at 160 Celsius now cooking time between 15 and 20 minutes and I say that because it depends on how big your scoops of cookie dough are but you'll see you'll get a beautiful golden edge around around the outside we'll come back and have a look alright so things are currently smelling like cookie heaven now these guys are gonna look see see how they've kind of got that that golden edge but if you're kind of moving around now they'll be very soft so you need to exercise some patience and just let them sit around for at least 10 even 15 minutes and just wait till they firm up a little bit don't touch them that's because okay we're back these cookies are looking amazing let's just get them out here they're still a little warm and a little bit soft but still good okay should we get in here and have a look let's get in here look okay so just break one open oh wow that chocolate I mean look at that ooze that's just incredible I love it I love it so much um that let's just try one shall we hmm that ooze I mean I call it a crack cookie for a reason because it's like it's like the mix of it saltiness and the sweet chocolate and the peanut butter and that and it's like literally telling you that you have to keep eating these for a long time seriously addictive oh my it is hmm so yum when you're making a sandwich it's all about the details and the secret is to keep that beef really nice and moist so we're going to start off with a Korean style marinade that's going to add tons of flavour and help to keep our beef mass and juicy some soy sauce sesame oil nice little dash of honey and some finely grated garlic now I'm also going to use some nashy pear or asian pear and this is going to actually help to tenderize the beef as well and then finally some spring onion um it smells so good already so now for the steak I'm using a really nice hunk of scotch fillet or ribeye depending on where you are and I'm going to slice that really thin and the great thing about this is that a little bit goes a long way so it's easier to invest in a great piece of steak for this dish okay so let's get now steak marinating those beautiful flavours now I'm just going to set that aside while I get on to a few little extras for the sandwich okay so we just want some fine slices of cucumber and then I've got some finely shredded carrot and that I'm just going to add a little bit of vinegar and a little bit of sugar and give that a good mix and just this little extra step really flavoring these vegetables makes all the difference just gives a nice little tangy fresh bite to your sandwich okay so that only needs about 10-15 minutes to just set that aside while you're finishing off the rest of your ingredients for the sandwich so the last thing that we need is a spicy sauce of course so a little bit of mayonnaise and to that I'm going to add some Korean gochujang which is a spicy chili paste and I love it it has this kind of very savory a little bit smoky kind of flavour you can find gochujang in the asian oil of most major supermarkets or an asian grosa if not use your favourite hot sauce so ratcha is fine for any kind of asian style hot sauce so good so for the beef you just want to heat a pan over a high heat add a little bit of oil and then let's get that beef sizzling so the key to keeping your beef nice and juicy is to do it high heat and quickly we wish you guys would smell this all the garlic in the sweet honey and the sesame oil it's creating a really beautiful sauce around that beef and the beef nice of adjust clips through you're going to take that off the heat and it's time to assemble okay so you want a good slathering of this gochujang mayonnaise and there's a little bit of greenery top that with some of your quick pickled carrot and cucumber already we have quite the magnificent little stack here and now for that warm saucy beef now don't waste those pan juices spoon a little bit of that onto your bread roll when you're making a sandwich it's all about the details and that my friends is one incredibly juicy very tasty steak sandwich so good spicy sizzling beef patties spiked with cumin seeds and Sichuan peppercorns and you already believe the amount of flavor in that sauce and then the little bread parcel of this whole thing is just unbelievably good this is my very non-traditional version of a meat filled bread parcel or a meat sandwich if you like from Xi'an province in China now the main flavor is here that I'm taking inspiration from the spices so cumin and Sichuan peppercorns let's get going on those first I want to toast these to really bring out the best flavor and you want quite a lot of cumin seeds more than you would think and some Sichuan peppercorns now just heat these until you can see little tendrils of smoke coming up off those spices and you'll be able to smell how beautiful they are okay these are looking good I'm going to get them into my mortar and then grind this to a sort of medium powder I don't mind having little chunks of cumin seeds in there I just want to make sure the Sichuan peppercorns are very finely ground and to that I want to add a very healthy teaspoon here of chili powder I really want a good kick of chili spice in these as well so that's our spice mix done let's get on to the burger patty part now I'm using some beef and I'm going to cut that with a little bit of pork mince for some extra fatiness and then you want to put in all but about two teaspoons of this spice mixture now I don't want to work this meat too much or too heavily I wanted to stay nice and loose and crumbly when it's in its little bread parcel so first of all I just want to make sure that I'm getting the spices and those two meats mixed together and I'm just doing that loosely with a fork and notice I'm not seasoning this with any salt either because the salt inside a burger patty you tend to make it a little tough for the third of season on the outside and now I want to form this into patties just by kind of pushing and pressing gently and not mixing or working that meat too much okay so you can see just how loose that patty is it's almost threatening to fall apart that's just what we want so next we're going to make a garlic yoghurt sauce now I've got some thick Greek yoghurt here so that I'm going to add some grated garlic and then a healthy dose of finely sliced coriander and the rest of that beautiful spice mix we made earlier now look at that tangy galahki those spices that is uh amazing yeah all right we're nearly there let's take a look at the bread that we're using so in this particular area of China they make really beautiful wheat flour buns for this kind of dish now I found these little pitta bread pockets at my supermarket and these are going to do just fine at a pinch so I don't have to make my own but what we won't take a short cut with is heating these guys up I want to get them into a pan and get them nice and soft and pliable and just a little bit chari on the outside now while we're waiting for those buns I'm going to salt our little patties here so a generous sprinkling a lot of the salt sort of comes off the outside of it it looks like a lot but it's not it's going to create a beautiful crust on the outside I want to have got a beautiful chari color on both sides I'm just going to take them out and split through the middle don't cut them all the way through I'd like to leave a little bit just at the end there to hold everything together now just pop a clean tea towel over those keep them nice and toasty while we cook our beef got a hot grill plate here I'm going to add some oil just brush that so I've got an even coating and on go my burger patties now you want to season this second side with some self as well now these are quite thin so they don't take too long all I want is some beautiful blistering color on the outside and a few minutes to cook them through on the inside so these are looking good and they're smelling amazing a lot of that such a run-triple pan smell around it just out of this world for it now just on that same grill plate or in the same pan add a little bit more oil and then time to get in some ice add a little salt to help them turn around and soften up now add some capsicum as well so now these vegetables are looking beautifully sweet and soft I'm going to add some spring onion just that too now it's time to build our sandwich take one of my buns I want a very generous helping of that beautiful spicy yoga one of my burger patties and some of those onions and capsicum so so there you go if you're looking for a burger alternative something that it's full of spicy goodness well this is the dish for you so good that beef has the most amazing texture it's really soft and that human flavor right through that sandwich and then the sour yoga anytime I'm doing burgers I'm definitely doing these yum so perfect crispy light as a feather pastry that's what this one is all about and check out that beautiful spiral pattern and the crimping and all the things this is my version of the classic curry puff so this one it's all about the pastry the pastry is key here my friends and let me tell you it took me ages a long time lots of different goes to work this one out but now that I have worked it out it's going to be very easy for you let's get going on that dough first of all we need to make two different doughs here so the first dough we're going to make is the water dough and look I've seen these different doughs called so many different things water dough oil dough butter dough lots of different names we're just going to go with weight oil dough no water dough water dough all let's call this one the water dough the main point is that you want to use some cake flour the cake flour has a lower protein content it's not going to give us as much stretch doesn't have as much gluten which means that we're going to get a shorter pastry which is a bit more crumbly which is kind of the what we're after here you could use all purpose or plain flour if you can't get a hold of cake flour but I get the best results with the cake flour now add in some salt here and some sugar just give that a mix now the fudge for this dough is oil hence we're calling it the oil dough let's call this one the water dough oh goodness even I'm getting confused we're calling this the water dough but we're adding oil we're adding oil we're going to have water as well goodness this is so confusing that's just a plain vegetable oil let's give that a mix and once that mixture kind of looks like this now you want to go in with some warm water I always like to add a little bit of time so that you know every time you kind of make a dough the I find you maybe just need a little bit more a little bit less water depending on all sorts of things are humidity the brand of flour you know all those sorts of things so and all the measurements the exact measurements for this are on my website guys it's just anointing to go through all the different conversions with friends from all over the world here I've got all the details in the written recipe so hit to my website to find that now once you've kind of got this thing going on in here like this you want to get your hands in there and really squish that dough together you can see it's now forming quite a nice sort of sticky ball in there so I'm going to get that onto my bench top here and the idea here is that you really want to work this dough until it's really nice and smooth so that's going to be about 10 minutes just want to knead and knead and knead and come back and have a look at what it should look like so let's see how this is really beautifully smooth now it went from kind of being a bit flaky to being really nice and smooth this just needs a bit of a rest so I'm just going to wrap this up and now I can just sit on my bench top while I make the butter dough start again with some cake flour and this time you want to go in with some cold butter and just kind of rub that butter in with your fingers now the reason we do the two types of dough is that to get that really lovely spirally texture you need two different types of dough that won't kind of like I don't know glue themselves together so much that you don't get the difference in the in the little layers and it just really makes for a really light crispy dough the combination of the two I've seen curry puffs made with puff pastry you know philly pastry that's all well and good and that you know they're quite good with that kind of pastry as well but for me like with the Thai street food snack version of this is the best and that's using this combination of those with that really crispy light texture so you know I like to go to the trouble of making these properly when I when I had the time all right so I've got this kind of like wet sand kind of situation going on here and it's actually quite interesting because I think these the origin story for this curry puff is like it kind of is an amalgamation or mixture of histories I think it's kind of like a mixture of the the British pasty you've got the Spanish empanada you've got the Indian Samoza it kind of has all those vibes to me if you like you know this butter pastry being more like a western short cross pastry if you like like for an English pasty or an empanada kind of thing although do you use butter for empanadas oh my goodness my Spanish cookery not so good so all the Spanish people can below can tell me about how to make empanada dough anyway so this is obviously more of a western style dough though with the butter now to here we're going to add some water this is just room temperature water so we added warm water before did I tell you to add warm water and once that mixture kind of looks like this now you want to go in with some warm water oh my goodness I'm really mixing everything up today but this time it's room temperature water or cold water because I don't want that butter to melt too much that's why and again just mix that and again get your hands in there when everything starts to come together and with this one we don't want to do too much kneading so with the butter if I went and just did like ten minutes of kneading I would literally have like a buttery mess all over my hands and actually even as I'm pulling this dough together I'm really just trying to use my fingertips rather than my palms because your palms are a lot warmer than your fingertips and I don't want this dough to heat up too much now I'm going to wrap this guy up as well and for this one though because of the butter content and as I said I'm trying not to get that butter to melt everywhere I'm actually going to put that into the fridge while we make the filling so we're doing a spicy potato version today and what you need to do is just take your peeled potato and I want some I want some sort of small dice here I don't want the potato beat to be completely like a big mush I do want some kind of little chunks rather than a mash now scoop those up into some boiling water now don't forget about your potato okay they're in small little chunks so just let it kind of cook for about ten minutes come back and check make sure it's not they're not overcooked or they haven't turned into a big mush in the meantime I just want to slice up some coriander stems and roots for my filling I like to do the stems and kind of fry them off with the aromatics first of all and I'll leave the leaves until a bit later on and add those in kind of fresh when the when the filling isn't too hot that way you get a really nice fresh coriander hit with the leaves but you also get the depth of flavor with the stems and the roots I'll say those leaves for later now if you don't happen to like coriander that's okay just swap these out for some spring onion you could do some herbs like dill or basil you know go your own adventure there guys now to keep going on this I need some oil and a hot pan now add in some onion and whenever I'm cooking onion I always love to add a little bit of salt not only to kind of layer up start layering up the flavor and this evening but to also help soften those onions up because the salt helps to draw out the moisture from the onions which helps them get nice and sweet and tender all the good things now that the onion is nice and sweet and soft now we can go in with our garlic and those coriander roots hmm it's smelling so good already um curry powder we're going to go in with some curry powder now I'm just using in fact I don't even know this is like um it's just a curry powder that I've get my supermarket so it's not any special kind of curry powder um you could use garam masala any kind of uh blend of spices that you usually use for curry wherever you are in the world in fact why don't you tell me what kind of curry powder you guys use because I'm always really interested to know so um my curry powder isn't too spicy this one um because my kids love to eat this as well so keep it a little mild for kids now at this point if your potatoes are ready um go ahead and add them straight in if they're not just switch this off and wait for your potatoes to cook but I think mine are going to be ready so I'm just going to scoot and straight out and into this mix here so now you can go in with some frozen peas some soy sauce here to add some extra flavor and saltiness a little dash of sugar you won't even taste the sweetness but it just gives you that little bit more of a I don't know like a dip um you know a roundness um to the flavor overall a little bit more salt and some white pepper I give this a really good mix and you'll see some of that potatoes start to break up a little bit that's cool um I kind of want that potato to be soft but a little chunky as I said to finish off that filling when it's nice and cool add in the coriander leaves all right so we have arrived at the pastry making time this is actually really cool guys I love this technique um okay open up your uh water dough or the oil dough first of all oh and I forgot take that butter dough out like about 10 minutes before you want to do this rolling because it'll have firmed up so much in the fridge um that'll probably be a bit too firm to roll it out so you know 10 five 10 minutes before you want to do it just take that out but first of all we start off without oil dough or water dough really need to sort out the name um water dough okay so I've just got some extra flour here always like to have flour when I'm rolling out dough in case things get a bit sticky but let's just see how we go huh and I always like to keep my dough moving around so that I can tell if it's going to stick to the bench top this one seems fun I think because we've got that oil content in here um and my bench top isn't up too sticky I guess uh this is all moving around very nicely don't need to add that flour so now unwrap your butter dough that goes in the middle here and fold the other water dough all the way around over the top completely cover that butter dough okay now at this point we need another little rest so pop that dough here and I want you to give that 15 minutes no cheating would you cheat just with your dad's yes how good are your curry puffs okay that was a legit 15 minutes I timed it to be sure come back unwrap your dough and now if you live somewhere really hot and 15 minutes out um might make your dough a little sweaty or a little soft sweaty sweaty dough no no okay now if you live somewhere really hot maybe just leave the dough in the fridge for 10 minutes and five minutes out on your bench top um I'm in a temperate kind of 25 degrees Celsius here so I'm all good but you just don't want that butter dough on the inside to get too soft um you'll be right I promise just in the fridge a little bit if you're somewhere hot okay now the point is here that we want to roll this out and you really want a rectangle shape here because um if you don't get a nice rectangle when we start to do some rolling the edges will be a lot thinner than the middle and you know everything's a bit uneven and my OCD kind of thing kicks in and I'm like oh no disaster um you don't have OCD kind of tendencies and you won't need to worry about it but I recommend going a rectangular shape okay so once you've got a really lovely thin-ish kind of rectangle here then you can start from this this bottom edge and just roll that up now just spin that around and again I want to roll this out again and I want to achieve that same rectangular shape so it might take a bit of like sort of coaxing here and then you can squish it again rolling okay now again we've got our rectangular shape here um I want you to roll it up just the same as before and there you go it's kind of a thing of beauty already look at that lovely spiral in there ah that looks so nice okay um now we want to divide this up and we're going for 20 portions here so however you want to make that happen but let's have a look in here because this really is quite joyful to look out in here look at that that beautiful even spiral all the way through there that my friends is just beautiful things like this might be so happy okay um all right stop being happy about the dough let's get on to making the actual pastry um just cut those up until you've got nice sort of sort of like little discs coins if you like of of dough I like to set them out on a tray or a board now grab yourself one piece of dough and just put a cover on the rest of those other pieces so they don't get dried out and roll out that piece so you've got it like it's that sort of like oh maybe three millimeters thick or something or two to three millimeters it's pretty thin and then just peel that carefully off your bench top now you want a scoop of filling maybe about like just over a tablespoon first we'll just fold the bottom half over the filling and then just pinch squish together the edges so you're starting off with you know kind of this kind of shape now to do the crimping uh we kind of you kind of mainly using your thumbs here so use this first thumb as a guide to kind of crimp that pastry over and then move on to the next one move that thumb pull the other pastry over that and just kind of like work your way around with your thumb as a place holder I guess for the crimp before and sort of just pull that around there you go just kind of push it down a little and just shape it nicely at the end there and that my friends is just pure delight look at that so cute oh so cute okay pop this onto a tray just with some baking paper in case it sticks and then just keep going now at this point you can pop your tray of beauties here into the freezer and keep them for another day once they're really firm just pop them into a ziplock bag and get rid of the tray so you're not taking up so much space but I am going to cook mine straight away because I am very hungry for curry puffs or it's hungry for curry puffs but to them extra hungry for curry puffs all right so just need some hot oil here I'm going to put my curry puffs in just do this in batches so you don't overcrowd the oil again if you overcrowd the oil you get the temperature dropping and then things don't get crispy so we don't want that at all I like to keep them moving in there once I've got a few in there turn it over now this should only take about three or four minutes you'll be out to tell because they will be little golden you crisp so when you've got things looking like this look at that golden deliciousness there just pop that out onto some paper towel continue on with the rest of your batch now just have a look at that tray there wow that makes me so happy I love all that you know all that hard work that we went to to get that pastry just right and look at that lovely golden swirl pattern that we've got through there that's just the way I love them when I'm getting them from a street food lady or a market in Thailand oh I missed Thailand now pop these out onto a plate and this is optional like quite often in Thailand we don't really serve them with a sauce but I like to serve them with some sweet chili so yeah further ado let's get in there shall we let's break this open oh that that pastry is out of this world good already I can tell see how really thin like so it's so crispy but it's so thin and this is what I mean about this particular pastry dough I mean if it was too thick then you'd get like you know a big kind of doughy clumps of it particularly where you've done that cooking but this is going to be good my friends all right so it's a little dunkier you know something is this perfect it's just mmm there aren't even the words the pastry just melted literally goes crisp in your mouth but then it just disappears like a little cloud and that feeling so beautifully soft beautifully spiced mmm good thing I made a lot it's easy going to get destroyed mmm oh I haven't had one of these since I was in Thailand in Bangkok before COVID mmm yeah I'm glad I figured out how to make the pastry mmm the world needs this pastry definitely yum mmm marion why don't we have any cheese left? okay because I hate people that is so fluffy look at that mmm what are we doing today? well I'm pretty excited because it's like literally carbs and cheese which are like two of my favorite food groups we are making the fluffiest cheesiest kind of pool of part bread and I'm going to be testing out whether you can make the ultimate loaf in the oven or in a microwave oven yes but along the way I do have some cool techniques for trying to get that really fluffy inside and then plus that really lovely golden exterior so stay tuned for that but let me mention first of all that we have partnered with Panasonic for this episode and we're going to be testing out their four-in-one convection microwave oven so this guy Bakes roast grills and steams and it's this steaming function that I'm really interested in because I've always wanted a steam oven but steam ovens are really quite expensive and I don't have one at home and steam oven baking can be one of the best things for making really good bread so I'm really interested in testing out how we go with steam oven versus regular baking the first thing we're going to do is get started on this technique which is a very Asian sort of bakery style technique for keeping your bread dough really moist and keeping everything really fluffy so first up we're going to heat up a little bit of the plain flour and the water from our bread recipe and we're going to heat that and turn it into a bit of a paste and you want to whisk and cook this to get a really thick paste okay so that doesn't take very long at all like a couple of minutes only and we're kind of looking here at almost like a roux if you like and we're going to use that a little bit later but first off let's mix up the rest of our dough so this should all look quite familiar now so we have our plain or all purpose flour to that I'm going to add some yeast I want some sugar and some salt now I'm going to need this a mix first make sure all my dry ingredients are incorporated right so now I can go in with all the wet ingredients our little flour water mix here so we need some milk and egg some melted butter now I've got my dough hook on here so I'm going to let this go and need for about 10 minutes if you're doing it by hand which you can do it by hand but if you're doing it by hand I'd probably give it about double that amount and we'll at least 15 anyway all right so come up on the 10 minutes now and this dough is looking so good you know I love that smell of the yeast and you know bread making is such a joy now a couple of things here I'm just going to pop a little bit of flour on my bench top here all right so this dough is looking really good I'm just giving it a couple of goes here with my hands shave it into a nice ball and I've just greased my bowl here just with a little bit of spray oil or butter will do as well pop that in now you just want to cover this up and our little friend here needs about an hour to rest or until it's doubled in size all right so now we have plenty of time to make our filling and what I'm going for with this filling is like obviously like really cheesy, easy cheesy goodness I'm going to start out with some grated cheese so I mean you could go any kind of adventure here right but I'm going today with good cheese because I think it has a really yummy flavor like it's cheesy but also has some of that kind of stretch the point is you want lots of cheese though okay so I'm going to put some spring onion in here as well and I want some sesame oil and some salt so this should be enough for two loaves because of course we're going to have one loaf going in the oven and one loaf going in the microwave oven using that steam function which I'm really excited about even more excited about having two loads of bread because two loaves is better than one I plan on eating a lot of bread okay so while the bread is proving I thought I'd have a coffee and I thought why don't make some dumplings because I love dumplings there's steam there's dumplings look at those guys I'm like I really I'm really happy with that I'm going to have a snack before we finish the bread so let's get the dough out oh that smell like honestly the yeasty's bread smell is so good I mean I literally feel like so wholesome right now all right so I want a little bit of flour on my bench top here because I don't want that dough to stick now you kind of want to punch the dough down a little bit we're going to take some of that air out so I'm just going to just need this a couple of times here now you want to cut this into two portions throughout two loaves put one portion back into the bowl and cover it up so it doesn't get dry and now with this one we are going to do a fancy pants little braid here which is so fun it's like you're stuffed cheesy crust pizza dreams in a soft bread roll all right so I want three equal portions here a little bit more flour and now you want to roll this out into like a long ish kind of rectangle like around about like 30 centimeters long about 10 centimeters width so now when you've got your lovely rectangle you want to go in with your cheese and now you want to roll this up so just grab the edges here so now we've got our lovely little rolls pressed down on the edges a little bit and do the same thing to the other portions okay so we have our lovely three logs here and what we need to do now is turn them into that like braided situation so this is going to look tricky it's not tricky but the thing you should do is start in the middle and not at the end because it's easier and we start off with a braid here well like a cross here and then like another cross here so this is going to look tricky it's not tricky all right so it's start again let's go okay so we make an X here and then this guy comes over here okay so in between and then this one comes over here and then this guy comes over here oh look at that see okay now I can do the other side so this comes over here and then this one comes over here all right now these tuck in under here so there you go guys that's your little braid now it looks a little small but it will get bigger so what you want to do is pop this onto a tray lined with some baking paper so it doesn't stick okay so now we have our two loaves and I'm going to cover them up and let them sit again for another hour or until they're doubled in size so before we get to have a look at what's been happening with our loaves let's get our egg wash going first of all so my little tip for whenever I'm doing an egg wash and I want a really golden color is to just use the yolks instead of the whole egg okay so now I just need a little bit of milk in here too and now finally let's come and have a look at our loaves all right so these guys are currently looking so beautiful I mean I just this hot the whole process of making bread is just delightful I have to say all right let's get on with our glaze so okay so final little juzh here we want some sesame seeds okay so now these need to go on the oven I'm going to pop this one into my regular oven and this one into my microwave oven all right so we're going to do a little bit of juzh over here because the cool thing about this microwave is not only does it have a steam cook function you can also steam and bake the thing you want to do with bread baking is you want to give your bread some steam at the beginning of the cook but not at the end so at the beginning it's going to help everything to let puff up and and rise and give you that beautiful kind of soft kind of situation in the bread but you only want to the beginning so I'm going to put this in and then do the steam shock function very excited out eventually so all right let's go in here I need to set the time first now I'm going to go in for like 22 minutes and then I want to start and press steam three minutes and it should be steaming no it is steaming I think it is I'm so intrigued by the steaming business I think we should leave a shot though so the steam is trapped in there right I think that's probably a good idea this one's looking really nice and brown come and have a look wow look at that look at that color okay so we're looking pretty good here I love how shiny that is all right that's been good let's wait and see what happens in our microwave okay let's have a look ta-da wow look at that color that's insane this is like this is bigger than the other one okay so we have like two very different rolls here so I feel like I feel like with this one the steam really made that dough expand probably look like more cooked through here this one kind of is a lot tighter but then you probably don't have as even a cook through these little bits through here darker color on this one though which I do like I do like this darker color better but I do feel like this is going to be like a more kind of fluffy even rise okay so I'm supremely happy with both of these they look different but what I want to know is what's happening on the inside so first of all let's get in here on our oven bake one now I'm going to pull this apart and wow look how fluffy that is so fluffy look at that hello cheese look at that oh wow yeah see all those little strands that's so lovely steam hmm that is Chinese bakery bread dreams cheese across pizza soft bread rolls cheese it's galley pancakes it's like all of those things oh my goodness mmm that is so good yum right that's pretty high benchmark I could literally eat that whole thing right now but I won't let's have a look at this one let's have a look in here oh wow look at that look at how fluffy that bread is I mean that is really insane I mean can you believe that we made this in a microwave absolutely ridiculous look at the size of that fluff like look at that look at that fluff look at that steam it's like oh it's so good let me have a look mmm okay both of these are ridiculous by the way really good I love it the outside is really beautifully it's golden it's like it's crispy and then it just sort of melts away in your mouth it's so beautiful okay so verdict time so I think now you can clearly see we have this over fluffy texture in here it's very light it's a lot bigger like puffier and then this one still good I mean that color on the outside is beautiful but if you have looked through the center it's not quite as fluffy it's a little drier as well I think that the steam cook like that little like punch of steam helped us to get like a much better even kind of rise and beautiful light fluffiness the consistency through the center of the of the bread if you know what I mean you know I mean they both taste amazing but I got to say I'm gonna go with the microwave I mean this sink the fluff the texture all the things it's kind of got all the things you wouldn't be disappointed with that but if you made that you'd be really happy like extra extra happy I'm literally eating half of this like I don't want to do it but like this is a perfect I mean if you cooked out you would be totally happy but like yeah",
  "recipe": {
    "title": "Japanese Katsu Sando",
    "ingredients": [
      "pork loin cutlets",
      "salt",
      "flour",
      "eggs",
      "panko bread crumbs",
      "hot oil",
      "Japanese style bread",
      "butter",
      "Japanese Tonkatsu sauce",
      "shaved cabbage"
    ],
    "steps": [
      "Sprinkle pork cutlets liberally with salt and let sit for 15-20 minutes.",
      "Prepare crumbing station with flour, whisked eggs, and panko bread crumbs.",
      "Coat pork cutlets in flour, then egg, and finally panko bread crumbs.",
      "Heat oil in a pan and fry the breaded pork cutlets until golden brown, flipping occasionally.",
      "Drain cutlets on paper towel and season with salt.",
      "Spread butter on slices of Japanese bread.",
      "Spread Tonkatsu sauce on the bread.",
      "Add a layer of shaved cabbage, then place the pork cutlets on top.",
      "Add another layer of pork cutlets and more sauce, then top with another slice of bread.",
      "Press down on the sandwich to compact it, then cut off the crusts and slice into thirds."
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": "Japanese",
    "tools": null
  }
}