{
  "url": "https://www.youtube.com/watch?v=e1GCGyEes50",
  "video_id": "e1GCGyEes50",
  "video_title": "The One Pot Greek Chicken Dinner You Can Make Tonight | Make it Wednesday",
  "channel": "Marion's Kitchen",
  "transcript": "Hey guys, welcome to another episode of Make It Wednesday. I love this series. Number one, because I love coming up with solutions for that. What am I going to cook for dinner tonight? Kind of vibe that goes on every day in my head anyway. And two, because I typically like to watch these episodes as they go live, so that I can chat to you in the comments below. So if you are watching now, please do say hello in the comments. Tell me where you're watching from. What are you doing? Are you having a glass of wine? Are you having a coffee? Is it still Tuesday? Where you are? It very well could be. So I have just returned from the Greek islands. So everything at the moment I'm cooking is Greek. So how you get inspired by those things? So we're going to make a one-pot Greek style chicken and orzo. So like that kind of like really lovely small pasta shape kind of dish. I do have a few tricks here for getting the maximum amount of flavour in a short amount of time. And one of those tricks is to roast my cherry tomatoes before I actually add them into my sauce. Because you kind of just get an extra layer of umami and flavour that you don't get if you just add in the raw tomato or just crushed tomatoes. So just a little, you know, a few little extra tips can make life so much more delicious. Now I'm just going to pop these in the oven just while I get my chicken cooking. Just so they blister a little bit. So with the chicken I am using bone in. Is this bone in? Yep. So bone in chicken thigh. With the skin on I love this cut because it's typically quite budget friendly and you get the benefit of the lovely skin. I'm just laying these out so I can get a really good surface area to do some seasoning. My salt. I have some oregano that I've popped on here as well. Now don't worry I do sometimes I get questions about whether I am touching the chicken and touching everything else. I do wash my hands in between to kind of cuts of the video. It's just a dice! It's just because you know if I come over here then you see duly and the camera and so we don't always show it but I am doing it. I'm from us. Now the little secret here is that I like to use my lemon zest for the chicken part and then I'll use the juice a little bit later on for the pasta part because of course the more moisture that you add the less likely you are to get that beautiful lovely brown golden color. So that's the reason there's always method to the madness a little bit of fresh oregano here as well. No that's time. A little bit of fresh time. I might just add a little bit of grated garlic here as well and while that's happening I will get my pan heating up. You really want to choose a pan here which is quite solid that will happily go from stove top into the oven. I always think with these one pot dishes it's always great. You can start on a stove top and get some really nice colour and then move it into the oven to finish cooking gently. Okay so I'm going to add in some oil here now you'll notice in the recipe that I did call for olive oil and not extra virgin so we can get a little food no to here while we're talking on a Wednesday night can't we? So olive oil has a higher smoke point so it is more suitable to searing things and also not as expensive as extra virgin extra virgin should be used for finishing off dishes to give it a beautiful flavour so if you can try to use your olive oil for cooking and your extra virgin for finishing off your dish if that makes sense. Now the idea here is that I just want to get a little bit of colour on my chicken. If you haven't joined me for a make it Wednesday episode before then the idea here is that I do try to cook mostly in real time without too much you know time editing cut so that you know exactly how long it's going to take or you actually might want to cook along with me so that's the whole idea behind this series and there are other episodes you can get on over to watch as a playlist on my channel if you want to take it out. Now I know that a lot of my followers do watch this series but if you're new here and like this episode why not hit subscribe because then you'll always get notified whenever a new make it Wednesday is released. And let me know if you're a new subscriber I'd love to welcome you people to the channel. Okay this chicken's looking good. The other great thing with starting this dish with the chicken is that I'm trying to build up sort of layers of flavour here so I'm actually getting a lot of really beautiful chickeny kind of juices and also some of that lovely may add reaction happening with the fat and the oil and that chicken skin and this is giving us a really good flavour base for our whole dish. It's nothing like a smell of garlic and our adano. Oh so good. Okay these chickens looking pretty good it's just what's a nice colour on it. It still needs to be cooked through obviously. I'm just going to put it out, pop it down here first. Okay we'll leave that for a minute and I want to get a little bit more fresh garlic going here. You can smell those tomatoes in the oven. I wonder if we have anyone from Greece watching. We usually have people watching from all over which I love. So if you are watching from Greece or you're from Greece but you're living elsewhere I would love to know this isn't the most traditional dish. So, apologies and advance I'm just taking the flavours and being inspired by my Greek holiday to create something for a midweek meal. Now I think one of the things to debate most fiercely about the Greek islands is which Greek islands is the best. I know everyone has a different opinion. I went to quite a few so I did love the smaller more quiet islands more so than the more popular ones but if you have a suggestion for your favourite Greek island please do let me know below because when I go back I would love to check it out. I'm sure everyone else would love to use some recommendations. Just pop my garlic back in there and I'm going to check out what's happening with my tomatoes. Oof, foggy. You know what glasses are great because they help with onion chopping but anytime there's any steam or getting things out of the oven they are not quite a big help. Okay so you can see the tomatoes here have just blistered and softened a little bit and also that oil has got a nice little kind of like tomato-y sheen to it. All good flavours and you can see now almost immediately the tomatoes as I press down on it squishes into the most beautiful lovely oil going with here kind of sauce here and I just love this extra added dimension of flavour which takes like no time at all. So really good little first step trick there. Now because midweek I do like to try and be as virtuous as I can with my dinners I like to add in as much green as I can so I'm going to add in here some baby spinach which looks like a lot it's going to wilt down. Okay so this is such a great base of flavour here. I am now going to start adding in a few more things and getting some liquid going so I can add in my auze. So auze is this kind of pasta shape it sort of looks like rice I think it's such an underrated pasta shape it kind of becomes all glossy and shiny and almost creamy at the end it's yeah I'm going to add in some chicken stock here my auze a few more sprigs of time here and now I'm going to nest all my chicken back into this mix now I'm going to put this into the oven uncovered so I can get more colour on that chicken for 30 minutes or until the chicken is cooked through and that auze pasta is tender all right this is currently smelling amazing oh my goodness look at the colour that chicken and that pasta in there is beautifully cooked oh so good so just to finish this off I'm going to add some Greek feta cheese and just crumble that all over and let's finish it off with a little bit of greenery and parsley here and then I said I wasn't going to waste my lemon so let's use that and there you go that is my one-part Greek style chicken with auze wow so good such an easy dinner to make as well I mean you know it does take time in the oven but literal prep time so easy we have a look in here oh smells so good tomato-y spinach pasta and then we go wow I just love a one-porks tree do you love one pot? okay I know you do when you've got two boys and I know what it's like you get home from work and you just want a little dish washing as possible and dinner on the table hmm that flavour is insane it's so good cooking short pasta like this means that it just soaks up all of tomato-y and the chicken-y kind of flavours oh yum that is amazing I love it so much um do you know what I also love chatting to you guys on a Wednesday thank you so much for joining me I hope you enjoyed this recipe and if you did don't check the back catalog there's so many great things to make on a week night and if you haven't subscribed please do because I would love to welcome you to the channel okay thanks guys see you on another Wednesday bye I just waved to the camera I know I just waved to the camera what's one of those shows you know the game shows he's bye everyone's awayering and yummy oh",
  "recipe": {
    "title": "One-Pot Greek Style Chicken and Orzo",
    "ingredients": [
      "bone-in chicken thighs with skin",
      "salt",
      "oregano",
      "lemon zest",
      "fresh oregano",
      "fresh thyme",
      "grated garlic",
      "olive oil",
      "cherry tomatoes",
      "baby spinach",
      "chicken stock",
      "orzo pasta",
      "Greek feta cheese",
      "parsley",
      "lemon juice"
    ],
    "steps": [
      "Roast cherry tomatoes in the oven until blistered.",
      "Season chicken thighs with salt, oregano, lemon zest, fresh oregano, fresh thyme, and grated garlic.",
      "Heat a solid pan on the stove and add olive oil.",
      "Sear the chicken thighs until they have a nice color.",
      "Add garlic and check the tomatoes in the oven.",
      "Add baby spinach to the pan.",
      "Add chicken stock and orzo pasta to the pan.",
      "Nest the chicken back into the mix and put it in the oven uncovered for 30 minutes or until cooked through.",
      "Crumble Greek feta cheese over the dish and finish with parsley and lemon juice."
    ],
    "servings": null,
    "cook_time_minutes": 30,
    "cuisine": "Greek",
    "tools": null
  }
}