{
  "source": "wikibooks",
  "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AHigh_Protein_Diet",
  "license": "CC BY-SA 3.0",
  "attribution": {
    "project": "Wikibooks",
    "title": "Cookbook:High Protein Diet",
    "url": "https://en.wikibooks.org/wiki/Cookbook%3AHigh_Protein_Diet",
    "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."
  },
  "recipe": {
    "title": "Cookbook:High Protein Diet",
    "ingredients": [
      "Protein is essential for building muscle.",
      "Unlike carbohydrates, protein provides long-lasting energy without an insulin surge (which promotes fat storage).",
      "Protein tends to suppress the appetite.",
      "Protein takes quite a bit of energy to digest, which boosts the body's metabolism.",
      "Lean protein-rich foods are much less calorie-dense than carbohydrate-rich foods. For example, the ham in a common sandwich may have 343 kJ per 100g, whereas the bread has 1011 kJ per 100g. Like vegetables , they help to bulk out a meal."
    ],
    "steps": [
      "Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Special diets",
      "A High Protein Diet is often recommended by bodybuilders and nutritionists to help efforts to build muscle and lose fat. It should not be confused with low-carbohydrate diets such as the Atkins Diet , which are not calorie-controlled and which often contain large amounts of fat.",
      "High Protein diets typically obtain 30%–60% of their calories from protein , 15%–30% from fat and the remainder from carbohydrates . They tend to rely heavily on seafood and lean meat, which makes them difficult or impossible for vegetarians .",
      "The daily food intake that is detailed below contains 1250 kCal in total, and would therefore be suitable for someone with 45 kg of lean bodyweight—such as a 60 kg female with 25% bodyfat—who wants to lose weight at a rate of ¼–½ kg a week (the maximum safe rate). Individuals with a greater lean bodyweight should increase their food intake proportionately, as should lean individuals who are attempting to gain weight. 50% of the calories come from protein, 25% from carbohydrates and 25% from fat.",
      "Anyone attempting to reproduce this diet should try to find products that match the nutritional profiles shown below. The protein, carbohydrate and fat content is given as their percentage by weight, which is the same as grams per 100g (as marked on nutritional labels). This is not the same as the percentage of calories.",
      "A multivitamin supplement should be taken to ensure that adequate levels of each essential vitamin and mineral are maintained.",
      "Some of the milk can be put towards cups of coffee or tea throughout the day. If required, artificial sweeteners should be used instead of sugar. Milk is an important weapon against osteoporosis, not just because of its calcium content, but because it also contains enzymes that promote bone growth.",
      "In order to achieve the recommended six meals a day, one sandwich should be eaten mid-morning, one at lunchtime and one mid-afternoon. Soya/linseed bread has very low Glycemic Index (36), which also helps to ensure a steady release of energy during the day. Lettuce or sliced tomato may be added to make the sandwiches more interesting."
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": null,
    "tools": null
  }
}