{
  "source": "wikibooks",
  "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ACookware",
  "license": "CC BY-SA 3.0",
  "attribution": {
    "project": "Wikibooks",
    "title": "Cookbook:Cookware",
    "url": "https://en.wikibooks.org/wiki/Cookbook%3ACookware",
    "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."
  },
  "recipe": {
    "title": "Cookbook:Cookware",
    "ingredients": [
      "crepe pan",
      "Double boiler",
      "Dutch oven",
      "Frying pan",
      "Makiyakinabe pan",
      "Paella pan",
      "Roasting pan",
      "Pressure cooker , including multicooker as Instant Pot .",
      "Saucier Pan",
      "Saucepan (typically called a \"2-quart (2 L) pot\" or \"4-quart (4 L) pot\")",
      "Sauté pan",
      "Stock pot",
      "Tava",
      "Wok"
    ],
    "steps": [
      "Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Cookbook equipment",
      "Cookware holds food, generally for cooking on a range . Sometimes pots and pans are used in an oven or, if they do  not include metal, in a microwave .",
      "Dark gummy burned-on oil can be removed with acetone, widely available from hardware stores and in diluted form as nail polish remover.",
      "Cookware and bakeware are containers in a kitchen for food preparation. Cookware are for use on a stove or range cooktop. Bakeware are for use inside an oven. Some utensils are used for both types of cooking.",
      "There are many types of cookware and bakeware. The material are constructed affects the quality of the vessel and the quality of the food cooked. Factors to consider are the thermal conductivity, how food sticks in use, and the surface pre-preparation, i.e., seasoning, before use.",
      "A factor to consider in selecting is the heat conductivity of the handle. If it is molded to the vessel of the same material Then precautions need to be followed in handling the vessel when hot. Avoid hollow handles because they are difficult to clean or dry. Additionally, a good cooking pot design has an \"overcook edge\" where the lid actually rests and the lid has a dripping edge that prevents condensation fluid from dripping from the lid when handling.",
      "Metal pots need to conduct heat well and be chemically unreactive to avoid altering the flavor of the food being cooked. These two factors are usually mutually exclusive and the vessel is a compromise between them.  Clad vessels are attempt to get the bes of both.  For example a copper pot clad or tinned with another metal.",
      "Stainless steel is good enough for most uses, although it is not as conductive as aluminium or copper. Stainless steel tends to be inexpensive and lightweight. Stainless steel has the advantage of being non reactive with most household acids. Thin-bottomed pans, often with an insignificant layer of copper, can cause uneven heating, so a layer of aluminium is often \"sandwiched\" in the base of the pan."
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": null,
    "tools": null
  }
}