{
  "source": "wikibooks",
  "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AVegetarian_cuisine",
  "license": "CC BY-SA 3.0",
  "attribution": {
    "project": "Wikibooks",
    "title": "Cookbook:Vegetarian cuisine",
    "url": "https://en.wikibooks.org/wiki/Cookbook%3AVegetarian_cuisine",
    "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."
  },
  "recipe": {
    "title": "Cookbook:Vegetarian cuisine",
    "ingredients": [
      "Cinnamon Roll",
      "Crispy Sweet Potato Fries",
      "Falafel",
      "French Fries",
      "Fresh Mozzarella Bruschetta",
      "Grape leaves",
      "Grits",
      "Hush Puppies",
      "Inarizushi",
      "Kovaim",
      "Latkes",
      "Samosa",
      "Sauerkraut",
      "Stroopwafels",
      "Tomatoes with Cheese Stuffing",
      "Plantain Chips with Cayenne (Kelewele)",
      "Pierogi",
      "Popcorn",
      "Pretzel",
      "Vegetable Spring Roll",
      "Vegetarian Meatballs",
      "Roasted Eggplant",
      "Roasted Rice Cakes of Japan (Mochi)"
    ],
    "steps": [
      "Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Special diets | Cuisines",
      "People may choose to become vegetarian for a variety of reasons , and meat-eaters may eat vegetarian meals.",
      "In North America, one is considered a vegetarian if one does not eat animal meat .  In some parts of the world, people who call themselves vegetarians do eat fish and/or seafood; in North America these people would be referred to as semi-vegetarians or pescetarians. If you are traveling abroad, or if you are entertaining foreign vegetarians, be sure to verify that you are communicating the correct meaning of 'vegetarian'.",
      "Some vegetarians do eat eggs and/or dairy products, although it is important for vegetarians to note that many soft cheeses, especially French cheeses, may contain animal rennet which is obtained from calf stomachs (and is therefore not considered vegetarian). Those who do not eat any animal products are called vegans; see vegan cuisine . Vegan recipes are always vegetarian.",
      "Non-vegetarians often eat vegetarian meals without labelling them as such (many pasta dishes, dahls, veggie burritos, and virtually all desserts).",
      "According to the American Dietetic Association , \"appropriately planned vegetarian diets are healthful, nutritionally adequate, and provide health benefits in the prevention and treatment of certain diseases.\"  The main requirement for vegetarian nutrition is to ensure your diet contains a wide variety of grains, vegetables, and legumes, and to a lesser degree fruits, nuts, and seeds.  It is a common misconception that vegetarian diets provide inadequate protein.  While one person's protein requirements may be very different from another's, the ADA has found that a typical varied vegetarian diet that meets one's energy needs, also meets one's protein requirements.  Even athletes, whose protein requirements are typically greater than non-athletes, can fare well on a vegetarian diet.  The ADA found that \"vegetarian diets (except possibly fruitarian and strict macrobiotic diets) can easily meet the nutritional requirements of all types of athletes provided they contain a variety of plant-foods.\"  ( see ADA article )",
      "As a general rule, two or more different vegetarian protein sources should be eaten in a day to ensure that the body gets all the essential amino acids it needs. The only complete (containing all essential amino acids) plant protein is soy, found in products like tofu. Animal products, like eggs and cheese, are also complete proteins, but vegetable protein sources (e.g. beans, chickpeas, lentils, nuts) other than soy are all incomplete proteins and must be eaten in combination.",
      "The Vegetarian Society has a page on vegetarian nutrition ."
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": null,
    "tools": null
  }
}