{
  "source": "wikibooks",
  "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ABaking",
  "license": "CC BY-SA 3.0",
  "attribution": {
    "project": "Wikibooks",
    "title": "Cookbook:Baking",
    "url": "https://en.wikibooks.org/wiki/Cookbook%3ABaking",
    "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."
  },
  "recipe": {
    "title": "Cookbook:Baking",
    "ingredients": [
      "Blind baking",
      "Shirring",
      "Clay Pot Cooking"
    ],
    "steps": [
      "Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Cooking techniques",
      "Baking is cooking food in an oven with dry heat applied evenly throughout the oven and is synonymous with roasting . Although it is common in some cultures to use the term baking for the so-called baked-goods, such as breads , cakes and pastries , and 'roasting' for other foods, such as meats and vegetables, the terms can also be used interchangeably.",
      "The dry heat of baking causes the outside of the food to brown or char, giving it an attractive appearance and pleasing taste. The browning is caused by caramelization of sugars and is the result of the Maillard reaction. Despite common misconceptions about the browning process, moisture is never entirely sealed into the food. Over time an item being baked will continue to lose moisture. This can be an advantage, especially in situations where drying is the desired outcome, for example in drying herbs or in roasting certain types of vegetables . Where drying is not desired, a protective layer of butter , oil , or, in the case of breads and pastries, egg wash , can slow the loss of moisture as well as providing flavor and additional browning. Alternatively, some foods are replenished with moisture during baking by placing a small amount of liquid (such as water or broth ) in the bottom of the pan and letting it steam up into or around the food.",
      "\"Starch gelatinization in bread doughs and cakes forms an important part of the supporting structure of baked goods\" [ 1 ]",
      "\"During baking, heat and mass transfer takes place in the dough simultaneously and interde- pendently, and involves four major changes:",
      "1. Gases are vaporized as the temperature increases: the gas cell increases in volume provided that the cell wall retains gases and is deformable.",
      "2. Starch gelatinizes as temperature increases to an extent depending on the local availability of water; proteins coagulate. These changes limit the dough extensibility.",
      "3. The initial structure with closed gas cells separated by dough walls is transformed into a porous structure with interconnected pores, known as the dough–crumb transition."
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": null,
    "tools": null
  }
}