{
  "source": "wikibooks",
  "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AAnnatto",
  "license": "CC BY-SA 3.0",
  "attribution": {
    "project": "Wikibooks",
    "title": "Cookbook:Annatto",
    "url": "https://en.wikibooks.org/wiki/Cookbook%3AAnnatto",
    "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."
  },
  "recipe": {
    "title": "Cookbook:Annatto",
    "ingredients": [],
    "steps": [
      "Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Ingredients | Spices and herbs",
      "Annatto , also called onoto or achiote , is a spice and food coloring made from the seeds of the South American achiote tree. [ 1 ]",
      "Annatto seeds grow inside the spiky pod of the achiote tree and have a red color. [ 1 ] [ 2 ] The mature seeds are harvested, after which they can be dried and powdered, processed into a paste, or steeped in oil or water. [ 1 ] [ 3 ] Theses seed extracts lend a yellow-orange color to foods. [ 1 ] [ 2 ]",
      "In addition to their vibrant color, annato seeds also have a mild peppery and musky flavor. [ 1 ] [ 3 ] These flavors are largely derived from its terpene family and caryophyllene content. [ 2 ]",
      "Annatto powder has a long shelf life (up to a couple years) when stored in an airtight container away from light and heat. [ 1 ] The paste and oil have a shorter shelf life, remaining good on the order of weeks to months when stored in the fridge. [ 1 ] [ 3 ]",
      "If you cannot find any annatto, a substitute can be made by combining equal parts of ground turmeric and paprika to approximate its color and flavor profile. [ 3 ]",
      "Annatto is widely used in Central/South American cuisines, as well as in those of the Caribbean and the Philippines. [ 1 ] [ 3 ] The traditional Venezuelan dishes hallaca and perico use annatto in their preparation.",
      "Due to its potency as a colorant, annatto is frequently used in many foods to give them a yellow-orange color. Various cheeses , condiments , beverages, and snacks contain it. For example, annatto gives cheddar and red leicester their colour, and it helps tint butter and margarine yellow. [ 1 ]"
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": null,
    "tools": null
  }
}