{
  "source": "wikibooks",
  "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AKosher",
  "license": "CC BY-SA 3.0",
  "attribution": {
    "project": "Wikibooks",
    "title": "Cookbook:Kosher",
    "url": "https://en.wikibooks.org/wiki/Cookbook%3AKosher",
    "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."
  },
  "recipe": {
    "title": "Cookbook:Kosher",
    "ingredients": [
      "Any fish that has both scales and fins. This means that shellfish are not kosher, and neither are fish like catfish."
    ],
    "steps": [
      "Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Special diets",
      "Kosher refers to that which is prepared in accordance with Jewish law. Kosher foods are foods that practicing Jews are allowed to consume. The specific rules are enumerated in the Torah and refined in the Talmud. There are two groups of rules: what can be eaten and how it can be prepared.",
      "The U or K within a circle are two of many symbols used by Jews in the USA to identify kosher products. A \"plain k\" [a K all by itself] does not mean that the food is certified kosher, but rather that the company declares it to be kosher. Many Jews do not accept \"plain k\" as a legitimate kashrut certification. Some Jews will not accept certain certifications, as interpretations and levels of observance vary from Jew to Jew.",
      "If you are entertaining for people that you know or think may keep kosher, be sure to ask them about their personal rules, as there are many interpretations and subtle variations.  Depending on their observance, they may be fine eating a vegetarian dish cooked in your home, or may not be comfortable doing anything more than eating unprepared fruit. Strict Kashrut includes categorizing the cooking vessels, the serving containers, the cutlery and the cooking surfaces as kosher or non-kosher as well.  Generally, if a pot has been previously used to cook non-kosher meat, one cannot use it to produce a kosher meal.",
      "Holidays from an important part in the Jewish life, and have many special foods and meals associated with them. Passover in particular has an entire cuisine, due to the prohibition of leavened breads. For recipes that are kosher specifically for Passover, see Category:Passover recipes ."
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": null,
    "tools": null
  }
}