{
  "source": "wikibooks",
  "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ABoiling",
  "license": "CC BY-SA 3.0",
  "attribution": {
    "project": "Wikibooks",
    "title": "Cookbook:Boiling",
    "url": "https://en.wikibooks.org/wiki/Cookbook%3ABoiling",
    "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."
  },
  "recipe": {
    "title": "Cookbook:Boiling",
    "ingredients": [],
    "steps": [
      "Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Cooking techniques",
      "Boiling , as it applies to cooking, means cooking foods in boiling water. In most populated parts of the world, plain water boils at temperatures from about 200째F to 212째F (95째C to 100째C). This varies with the atmospheric pressure, which in turn varies with both altitude and weather. When the water is salted, the boiling temperature is slightly higher than for clean water.",
      "When the atmospheric pressure on the surface of the water is lessened, boiling takes place at a lower temperature than that mentioned, and in extremely high altitudes the boiling point is so lowered that to cook certain foods by means of boiling water is difficult. As the water heats in the process of boiling, tiny bubbles appear on the bottom of the vessel in which it is contained and rise to the surface. Then, gradually, the bubbles increase in size until large ones form, rise rapidly, and break, thus producing constant agitation of the water.",
      "Boiling has various effects on foods. It toughens the albumin in eggs, softens the fiber and dissolves the connective tissues in meat, softens the cellulose in cereals, vegetables, and fruits, and dissolves other substances in many foods. A good point to bear in mind in preparing foods by boiling is that slowly boiling water has the same temperature as rapidly boiling water and is therefore able to do exactly the same work. However, certain recipes may specify rapid boiling or slow boiling due to other conditions (such as not wanting to disintegrate soft food, or wanting to make use of the bubbles that appear in rapid boiling).",
      "Turning the stove on high, keeping the gas burning full heat, or running the fire hard to keep the water boiling rapidly is therefore unnecessary; besides, it wastes fuel without doing the work any faster and sometimes not so well. However, there are several factors that influence the rapidity with which water may be brought to the boiling point; namely, the kind of utensil used, the amount of surface exposed, and the quantity of heat applied.",
      "A cover placed on a saucepan or a kettle in which food is to be boiled retains the heat, and thus causes the temperature to rise more quickly; besides, a cover so used prevents a loss of water by condensing the steam as it rises against the cover. As water boils, some of it constantly passes off in the form of steam, and for this reason syrups or sauces become thicker the longer they are cooked.",
      "The evaporation takes place all over the surface of the water; consequently, the greater the surface exposed, the more quickly is the quantity of water decreased during boiling. Another point to observe in the boiling process is that foods boiled rapidly in water have a tendency to lose their shape and are reduced to small pieces if allowed to boil long enough.",
      "Many recipes for pork ribs call for parboiling them before cooking, but this method is not recommended, as water is a solvent and may wash away flavors."
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": null,
    "tools": null
  }
}