{
  "source": "wikibooks",
  "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AEating_for_Health",
  "license": "CC BY-SA 3.0",
  "attribution": {
    "project": "Wikibooks",
    "title": "Cookbook:Eating for Health",
    "url": "https://en.wikibooks.org/wiki/Cookbook%3AEating_for_Health",
    "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."
  },
  "recipe": {
    "title": "Cookbook:Eating for Health",
    "ingredients": [
      "Your diet choice is no good if you don't think you can follow it long-term.",
      "Your diet choice doesn't make up for smoking, lack of exercise, or any other bad habit; however, a healthful diet is a critical ingredient for a healthy body and you will enjoy many benefits from making good eating decisions."
    ],
    "steps": [
      "Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Special diets",
      "A healthful diet brings many benefits. It can help one avoid cancer and heart disease, control weight, and avoid diabetes. A healthful diet can also have effects on mood.",
      "In choosing a healthful diet, you must start with two important concepts:",
      "Not everyone is trying to lose weight, but as an example, suppose that you are. Suppose that you eat a delicious treat. Would you consider yourself a failure? You shouldn't!  Allowing thoughts of failure may only give you an excuse to give up on healthy eating.",
      "If you are trying to lose  weight, cutting down the treats and making sure you eat plenty of vegetables may help.  Beyond diet, losing weight depends on your activity level.  If your calorie intake (food) exceeds your calorie output (activity) your body will store the excess calories as fat.  Weight loss requires your calorie intake to be lower than your calorie output, though neither should be done in the extreme.",
      "Choose a different attitude.  Don't think of healthy eating as a \"diet\". Think of healthy eating as balanced eating. Healthy eating is a lifestyle and one that you should enjoy.  You will have difficulty eating well if you don't like the food.   Get yourself in the habit of making good dietary choices by trying different foods as well as different ways to prepare them to find healthy foods that appeal to you.",
      "One last thought, eating healthily does not mean starving yourself!  If you are hungry, eat.  Just be smart about what you take in.  Reach for apples or celery over candy bars or chips.  You don't need to feel like you have to cut out completely the occasional treat — just keep it that: occasional.",
      "Diet is hardly your main problem if you won't exercise. As with following a good diet, exercise is best if you can work it into your daily schedule. For example, try taking the stairs instead of the elevator whenever possible. Consider biking to work instead of driving."
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": null,
    "tools": null
  }
}