{
  "source": "wikibooks",
  "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AFruit",
  "license": "CC BY-SA 3.0",
  "attribution": {
    "project": "Wikibooks",
    "title": "Cookbook:Fruit",
    "url": "https://en.wikibooks.org/wiki/Cookbook%3AFruit",
    "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."
  },
  "recipe": {
    "title": "Cookbook:Fruit",
    "ingredients": [],
    "steps": [
      "Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Ingredients | Basic foodstuffs",
      "This section deals with fruit in the culinary sense rather than the botanical sense. Consequently, items that are botanically classified as fruits, but are often referred to in cooking as \"vegetables\" (e.g. tomato , squash, etc.) [ 1 ] [ 2 ] will be in the vegetables section, and not here.",
      "There is no universal set of characteristics shared by every culinary fruit. However, fruits do tend to share certain characteristics. For example, they are usually the seeded, fleshy, water-rich products of plants, [ 1 ] [ 3 ] with up to 95% water content in some varieties. [ 2 ] With some exceptions, they tend to be low in fat and protein [ 2 ] [ 3 ] and high in sugar and acidity. [ 1 ] [ 3 ] [ 4 ] [ 5 ] They tend also to be colorful and flavorful.",
      "All fruits go through a maturation and ripening process. The maturation stage brings them to the proper size and state of development—all fruits must go through this process on the plant. After maturation, fruits then ripen, wherein their color, flavor, and texture develop to their maximum potential. [ 5 ] During this stage, sweetness increases, acidity and astringency decrease, and the fruits become softer and juicier in texture. [ 2 ] [ 5 ] [ 6 ]",
      "Interestingly, because fruits remain alive for some time after picking, some fruits have the ability to continue ripening after harvest. [ 2 ] [ 5 ] [ 6 ] These are called climacteric fruits , [ 7 ] and they both secrete and react to ethylene gas, [ 2 ] which causes them to proceed through the physical ripening process. By exposing underripe fruits of this type to either artificial ethylene gas or another ripe fruit that is secreting a lot of ethylene, you can cause the underripe fruits to ripen faster. [ 2 ] [ 3 ] [ 8 ] On the other hand, by separating them from other ripe fruits, you can slow the ripening process. [ 2 ] Non-climacteric fruits must be allowed to fully ripen on the plant, as they will not develop further after harvest, [ 7 ] even if exposed to ethylene gas. In fact, exposure to ethylene simply causes these fruits to rot faster as they exhaust their stored reserves. [ 6 ]",
      "After picking and/or ripening to their peak, fruits will begin to decline, becoming overly soft and discolored, developing off-flavors, and eventually rotting. Colder temperatures will slow both the ripening and the decaying process, [ 2 ] [ 5 ] [ 8 ] so use refrigeration as needed to modulate the fruit's life cycle.",
      "Many fruits will darken and brown when cut or bruised. [ 1 ] [ 6 ] [ 7 ] [ 9 ] This is called \"enzymatic browning\" and results from the oxidizing action of the phenolase enzyme on certain compounds in the fruits. [ 6 ] While it is perfectly harmless, it can be unsightly. One way to reduce this is by tossing the fruit in citrus juice or acidulated water. [ 2 ] [ 9 ] [ 10 ]",
      "Because fruits have a wide range of native habitats, characteristics, uses, and phylogenies, it is extremely difficult to divide them into discrete categories. This section addresses a few different ways to classify them."
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": null,
    "tools": null
  }
}