{
  "source": "wikibooks",
  "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ABraising",
  "license": "CC BY-SA 3.0",
  "attribution": {
    "project": "Wikibooks",
    "title": "Cookbook:Braising",
    "url": "https://en.wikibooks.org/wiki/Cookbook%3ABraising",
    "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."
  },
  "recipe": {
    "title": "Cookbook:Braising",
    "ingredients": [],
    "steps": [
      "Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Cooking techniques",
      "Braising (from the French word braiser ) is a cooking technique that uses a mixture of dry and wet heats. First, the food is sautéed in a fat, charring it and sealing in flavour. Then the food is simmered slowly with a small amount of liquid which results in tender, flavourful food.",
      "Braising relies on heat, time, and moisture to successfully break down tough connective tissue and collagens in meat. It is an ideal way to cook tougher cuts. Many classic braised dishes such as Coq au Vin are highly-evolved methods of cooking otherwise tough and unpalatable foods.  Swissing, stewing and pot-roasting are all braising types.",
      "Most braises follow the same basic steps. The meat or poultry is first browned in hot fat.  Aromatic vegetables are sometimes then browned as well. A cooking liquid that often includes an acidic element, such as tomatoes or wine, is added to the pot, which is covered. The dish cooks in relatively low heat in an oven or atop the stove until the meat is fork-tender. Often the cooking liquid is finished to create a sauce or gravy.",
      "A successful braise intermingles the flavors of the foods being cooked and the cooking liquid. Also, the dissolved collagens and gelatins from the meat enrich and add body to the liquid. Braising is economical, as it allows the use of tough and inexpensive cuts, and efficient, as it often employs a single pot to cook an entire meal.",
      "Familiar braised dishes include Murshed, pot roast, beef stew, Swiss steak, chicken cacciatore, goulash, braised tilapia and beef bourguignon, among others. Braising is also used extensively in the cuisines of Asia, particularly Chinese cuisine. Vegetables can also be braised.  Glazed carrots are an example of a quick-braise, one which is done for a short period of time."
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": null,
    "tools": null
  }
}