{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AFresh_Mozzarella_Bruschetta", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Fresh Mozzarella Bruschetta", "url": "https://en.wikibooks.org/wiki/Cookbook%3AFresh_Mozzarella_Bruschetta", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Fresh Mozzarella Bruschetta", "ingredients": ["1 long loaf of crusty French bread", "3 medium ripe Roma tomatoes", "3 large fresh mozzarella balls", "24 fresh basil leaves", "Coarse salt", "Black pepper", "Extra virgin olive oil", "Oregano", "Balsamic vinegar"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Recipes | Appetizers", "Bruschette are small, open-faced sandwiches of tomato and mozzarella cheese. They are delicious, quick and easy to make, and perfect appetizers."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AAnnatto", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Annatto", "url": "https://en.wikibooks.org/wiki/Cookbook%3AAnnatto", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Annatto", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Ingredients | Spices and herbs", "Annatto , also called onoto or achiote , is a spice and food coloring made from the seeds of the South American achiote tree. [ 1 ]", "Annatto seeds grow inside the spiky pod of the achiote tree and have a red color. [ 1 ] [ 2 ] The mature seeds are harvested, after which they can be dried and powdered, processed into a paste, or steeped in oil or water. [ 1 ] [ 3 ] Theses seed extracts lend a yellow-orange color to foods. [ 1 ] [ 2 ]", "In addition to their vibrant color, annato seeds also have a mild peppery and musky flavor. [ 1 ] [ 3 ] These flavors are largely derived from its terpene family and caryophyllene content. [ 2 ]", "Annatto powder has a long shelf life (up to a couple years) when stored in an airtight container away from light and heat. [ 1 ] The paste and oil have a shorter shelf life, remaining good on the order of weeks to months when stored in the fridge. [ 1 ] [ 3 ]", "If you cannot find any annatto, a substitute can be made by combining equal parts of ground turmeric and paprika to approximate its color and flavor profile. [ 3 ]", "Annatto is widely used in Central/South American cuisines, as well as in those of the Caribbean and the Philippines. [ 1 ] [ 3 ] The traditional Venezuelan dishes hallaca and perico use annatto in their preparation.", "Due to its potency as a colorant, annatto is frequently used in many foods to give them a yellow-orange color. Various cheeses , condiments , beverages, and snacks contain it. For example, annatto gives cheddar and red leicester their colour, and it helps tint butter and margarine yellow. [ 1 ]"], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AIntroduction", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Introduction</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3AIntroduction", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Introduction</span>", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages", "The Cookbook is a Wikibooks subproject , consisting of a collaborative effort to document and teach all aspects of cooking. It includes information on everything from ingredients to equipment and techniques, with a vast collection of recipes through which to apply this knowledge. A wiki is an ideal forum for communicating content such as recipes because it allows users to ask questions as well as to give feedback about recipes they have tried in order to iteratively improve them. As a living work, the Cookbook is also able to document developments in cooking technology as they appear, putting them in context over time and with respect to existing and past methodologies.", "The Cookbook is intended for a wide range of audiences with varying levels of skill in cookery. Novice cooks will find simple recipes , as well as a wealth of information to help them expand their understanding and skill. For more advanced cooks, the detailed information contained here can serve as a reference text, and more advanced recipes exist in our collection for their use.", "The Cookbook is primarily organized around pages and categories . The main page types in the cookbook are recipes , ingredients , equipment , techniques , and cuisines . Due to the sheer scope of the Cookbook and its status as a living and evolving project, manual updates of various indices are not feasible as they are with other books here. Instead, category pages function as automatically-updated tables of contents; they do not have additional content written about them. When a new page is created, it is added to all applicable categories (e.g. Italian recipes , fruits , etc), which helps maintain the Cookbook's organization over time.", "In addition to the category system, navigation is also possible through the primary table of contents , as well as the navigation bar at the top of cookbook pages."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AAesthetics", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Aesthetics</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3AAesthetics", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Aesthetics</span>", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages", "Eating is not just a necessary daily routine but a very sensual activity and a feast for the senses. When eating, all senses are activated at once: Your nose is exposed to the delicious smell; your fingers may feel the form and the texture of the food; your eyes cherish the arrangement and the colors of the various ingredients; your ears catch the sound of your biting into the food; and most importantly, your tongue experiences the main part – the taste. This page explores some basic ideas for enhancing the enjoyment of your other senses.", "The appearance of food can be a major contribution to enjoyment. Arrange the food on the plate with the same care you would use in creating a work of art - balancing colors and forms in a harmonious arrangement. To show off the food and put everyone at ease about cleanliness, use bright white (or natural) lighting with pure white dishes and clear glasses.", "The tongue recognises five basic flavors: salty, sweet, savoury, bitter and sour. One of the keys to a successful meal is to balance these, both within individual dishes and across different courses. It is usual to ready the palate with a cleansing neutral dish such as a consommé. Finish a formal meal with a sweet dessert, which customarily marks the psychological end of the event.", "The most important sense in preparing and cooking food is the sense of smell. It adds subtlety to the experience, which the tongue itself cannot recognise. The smell of food being prepared is one of the greatest stimulators of appetite.", "Think about the acoustic environment. Many meals in big restaurants are ruined because their surroundings are just too noisy. A shared meal should encourage conversation, and too much background noise can ruin that. If you're going to have background music, match the mood to the food.", "Touch might be better described as \"texture\".  The crumb of a baked good can be coarse or fine, the texture of one cut of meat may tend to be more tender or tough than another, and a family may prefer creamy smooth mashed potatoes or may enjoy them more with some lumps left in.  The purpose of many techniques in cookery and baking is to allow the cook to control the texture of the finished product.", "The temperature at which a food is served can affect the way it is experienced. Generally, sweet foods can be served cold (like ice cream), while for more subtle and aromatic foods a warmer temperature releases more of the flavor."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AEthics", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Ethics</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3AEthics", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Ethics</span>", "ingredients": ["Vegetarian", "Organic", "Free range", "Dolphin safe", "Ethical consumerism", "Fair trade"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages", "Many individuals feel that their cooking should reflect their ethics . Note that these ethics are not necessarily universal, and the chef is free to decide which of these is important. Note also that in some cases the efficacy in achieving these goals (such as gathering wild food to avoid buying farmed food) is questionable, or may even run counter to your goals. If you decide you care about these issues, it is up to you to research them.", "The treatment of animals is important to some cooks. Some may only consume eggs , meat , and dairy from free-range animals. Others will avoid eating any animals ( vegetarianism ) or will avoid any animal products at all ( veganism ). Some individuals will eat only seafood that has been caught without harming any dolphins or other marine life.", "The issue of sustainability has come up in cooking, especially with regard to climate change and damage to the environment. To achieve this, some individuals will preferentially eat food that is in season and local to their area, or will only eat food that they have hunted or gathered themself. Some also use reusable bags and avoid food with excess packaging in order to reduce the amount of waste they generate. Some vegetarians and vegans avoid animal products, associating a higher carbon footprint with animal husbandry.", "For some cooks, consideration of the needs of their guests is very important. In these cases, the cooks may take care to consider their guests' dietary needs and requirements, such as food allergies or religious requirements. They may also take care to not get hair, saliva, tears, fingertips, or other parts of themself in the food."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AHistory_of_Food_and_Cooking", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">History of Food and Cooking</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3AHistory_of_Food_and_Cooking", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">History of Food and Cooking</span>", "ingredients": ["The Forme of Cury , 1390 - http://www.ibiblio.org/pub/docs/books/gutenberg/etext05/8cury10.txt", "More links at http://cunnan.sca.org.au/wiki/Recipe"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages", "The origins of cooking began with primitive humans roughly 2 million years ago. [ 1 ] There are various theories as to how early humans used fire to cook meat. According to anthropologist Richard Wrangham, author of Catching Fire: How Cooking Made Us Human, [ 2 ] primitive humans simply tossed a raw hunk of meat into the flames and watched it sizzle. Another theory claims humans may first have savoured roasted meat by chance when the flesh of a beast killed in a forest fire was found to be more appetizing and easier to chew and digest than the conventional raw meat.", "Culinary techniques improved with the introduction of earthenware and stoneware, the domestication of livestock, and advancements in agriculture. In early civilizations, the primary employers of professional chefs were kings, aristocrats, or priests. The divide between professional chefs cooking for the wealthy and peasants cooking for their families engendered the development of many cuisines.", "A great deal of the study of culinary arts in Europe was organized by Jean Anthelme Brillat-Savarin, a man famous for his quote \"Tell me what you eat, and I will tell you what you are,\" which has since been mistranslated and oversimplified into \"You are what you eat.\" Other people helped to parse out the different parts of food science and gastronomy. Over time, increasingly deeper and more detailed studies into foods and the Culinary Arts has led to a greater wealth of knowledge.", "In Asia, a similar path led to a separate study of the Culinary Arts, which later essentially merged with the Western counterpart. In the modern international marketplace, there is no longer a distinct divide between Western and Eastern foods. Culinary Arts students today, generally speaking, are introduced to the different cuisines of many different cultures from around the world.", "The Culinary Arts, in the Western world, as a craft and later as a field of study, began to evolve at the end of the Renaissance period. Prior to this, chefs worked in castles, cooking for kings and queens, as well as their families, guests, and other workers of the castle. As Monarchical rule became phased out as a modality, the chefs took their craft to inns and hotels. From here, the craft evolved into a field of study.", "Before cooking institutions, professional cooks were mentors for individual students who apprenticed under them. In 1879, the first cooking school was founded in the United States: the Boston Cooking School. This school standardized cooking practices and recipes, and laid the groundwork for the culinary arts schools that would follow.", "The origin of many modern dishes can be traced back to ancient times, but there are very few surviving texts written before 1000 AD that deal with cooking. In many cases where texts exist, the recipes and directions they provide are little more than guidelines and assume much knowledge on the part of the cook."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ANutrition", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Nutrition</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3ANutrition", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Nutrition</span>", "ingredients": ["Vitamin A (also known as retinol) is a fat-soluble vitamin found in dairy products and in liver . Excessive vitamin A can poison you. The body can create vitamin A as needed from beta-carotine , which is water-soluble and not dangerous (large amounts can turn your skin and eyes orange, though). You can get plenty of beta-carotine from carrots , squash , and spinach . Vitamin A deficiency can affect the eyesight, so the popular belief that carrots help you see in the dark is not wholly false.", "The Vitamin B group of water-soluble vitamins contains a number of separate vitamins. An excess of these vitamins is not harmful. Vitamin B1 (or thiamine) can be found in beef, pork, legumes, yeast, egg yolks, milk, green leafy vegetables, and many grains, nuts, and seeds. Deficiency can cause beriberi. Vitamin B2 (or riboflavin) can be found in beef, dairy products, nuts, and green, leafy vegetables. Vitamnin B3 (or niacin) can be found in fish and poultry meats, liver, nuts, seeds, legumes, and green, leafy vegetables. Deficiency can lead to pellagra.", "Vitamin C (or ascorbic acid) is a water-soluble vitamin found in citrus fruits and green vegetables. A deficiency can lead to scurvy.", "Vitamin D (or calciferol) is a fat-soluble vitamin found in oily fish . With sufficient exposure to sunlight, most of the requirement can be met through the synthesis of vitamin D by the skin.", "Vitamin E (or tocopherol) is a fat-soluble vitamin found in vegetable oils, nuts and green leafy vegetables."], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages", "Human nutrition deals with the provision of essential nutrients in food that are necessary to support human life and good health. Carbohydrates, fats, and proteins are macronutrients, and provide energy. Micronutrients include minerals and vitamins.", "Fats are the highest source of energy, at 9 kcal per gram. These may be classified as saturated or unsaturated depending on their chemical structure.  Unsaturated fats (e.g., vegetable oil) are considered healthier, while trans fats are to be avoided. Saturated and some trans fats are typically solid at room temperature (such as butter or lard), while unsaturated fats are typically liquids (such as olive oil or flaxseed oil).", "FDA set a daily intake of total fats of 78 g.", "Saturated fats have been a staple in many world cultures for millennia. They are unhealthy as it increases 'bad' cholesterol levels. They are typically solid, as seen in butter and lard. The daily intake for saturated fat is 20 g.", "Main sources include meat, dairy products, chocolate and coconut.", "Unsaturated fats are a much healthier type of fat than saturated fats. They are found in nuts, seeds, fish and oils. They are usually liquids at room temperature. Ideally, people should consume more unsaturated fats instead of saturated fats.", "Trans fats are a type of unsaturated fats that are hydrogenated. They are very rare in nature, and have been shown to be highly detrimental to human health, but have properties useful in the food processing industry, such as rancidity resistance and solidifying. It is recommended to avoid consuming trans fats."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AFood_Safety_and_Sanitation", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Food Safety and Sanitation</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3AFood_Safety_and_Sanitation", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Food Safety and Sanitation</span>", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages", "Foodborne illness usually arises from improper handling, preparation, or storage of food. Good hygiene practices before, during, and after food preparation can reduce the chances of contracting an illness. There is a consensus in the public health community that regular hand-washing is one of the most effective defenses against the spread of foodborne illness. The action of monitoring food to ensure that it will not cause foodborne illness is known as food safety. Foodborne disease can also be caused by a large variety of toxins that affect the environment. Furthermore, foodborne illness can be caused by pesticides or medicines in food and natural toxic substances such as poisonous mushrooms or reef fish.", "Bacteria are a common cause of foodborne illness. The United Kingdom, in 2000, reported the individual bacteria involved as the following: Campylobacter jejuni 77.3%, Salmonella 20.9%, Escherichia coli O157:H7 1.4%, and all others less than 0.56%. In the past, bacterial infections were thought to be more prevalent because few places had the capability to test for norovirus and no active surveillance was being done for this particular agent. Toxins from bacterial infections are delayed because the bacteria need time to multiply. As a result, symptoms associated with intoxication are usually not seen until 12–72 hours or more after eating contaminated food. However, in some cases, such as Staphylococcal food poisoning, the onset of illness can be as soon as 30 minutes after ingesting contaminated food.", "Viral infections make up perhaps one third of cases of food poisoning in developed countries. In the US, more than 50% of cases are viral and noroviruses are the most common foodborne illness, causing 57% of outbreaks in 2004. Foodborne viral infection are usually of intermediate (1–3 days) incubation period, causing illnesses which are self-limited in otherwise healthy individuals; they are similar to the bacterial forms described above.", "The impact of chemical contaminants on consumer health and well-being is often apparent only after many years of processing and prolonged exposure at low levels (e.g., cancer). Unlike food-borne pathogens, chemical contaminants present in foods are often unaffected by thermal processing. Chemical contaminants can be classified according to the source of contamination and the mechanism by which they enter the food product.", "Agrochemicals are chemicals used in agricultural practices and animal husbandry with the intent to increase crop yields.", "Environmental contaminants are chemicals that are present in the environment in which the food is grown, harvested, transported, stored, packaged, processed, and consumed. The physical contact of the food with its environment results in its contamination.", "At home, prevention mainly consists of good food safety practices. Many forms of bacterial poisoning can be prevented by cooking food sufficiently, and either eating it quickly or refrigerating it effectively. Many toxins, however, are not destroyed by heat treatment. Techniques that help prevent food borne illness in the kitchen are hand washing, rinsing produce, preventing cross-contamination, proper storage, and maintaining cooking temperatures. In general, freezing or refrigerating prevents virtually all bacteria from growing, and heating food sufficiently kills parasites, viruses, and most bacteria. Bacteria grow most rapidly at the range of temperatures between 40 and 140 °F (4 and 60 °C), called the \"danger zone\". Storing food below or above the \"danger zone\" can effectively limit the production of toxins. For storing leftovers, the food must be put in shallow containers for quick cooling and must be refrigerated within two hours. When food is reheated, it must reach an internal temperature of 165 °F (74 °C) or until hot or steaming to kill bacteria."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AIngredients", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Ingredients</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3AIngredients", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Ingredients</span>", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages", "The cookbook contains many ingredients featuring in a variety of cultures and cuisines. Almost all foods are of plant or animal origin, although there are exceptions. Almost every form of life has been used as food, either for nutritive or ritual purposes, by one or more human societies at some time in the past.", "For a complete, alphabetical list of ingredients in the cookbook visit Category:Ingredients , or browse the subcategories below:", "To create a new ingredient page yourself, enter your title directly behind the Cookbook prefix below."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ACereal_Grain", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Cereal Grain</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3ACereal_Grain", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Cereal Grain</span>", "ingredients": ["Cookbook:Grains"], "steps": [], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ACondiments", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Condiments", "url": "https://en.wikibooks.org/wiki/Cookbook%3ACondiments", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Condiments", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Ingredients", "Condiments are foods used to add flavor to a dish, typically after cooking and when the dish is being served.", "Exact definitions of condiments vary. Some ingredients, such as ketchup and mustard, are widely accepted as condiments while others are more contested. The general consensus is that condiments are applied at time of food service, [ 1 ] [ 2 ] especially when done to taste by the diner. [ 3 ] [ 4 ] Because they are flavor enhancers, [ 5 ] [ 6 ] condiments tend to be well-seasoned with salt, acid, sugar, and/or herbs and spices. [ 3 ] [ 7 ] Some may be fermented or pickled. Many condiments take the form of a sauce or dip, and a wide variety of pre-prepared condiments are available for sale. [ 6 ]", "There is no universal way to store condiments. Many are shelf-stable, especially when preserved, but some must be refrigerated before and after opening.", "Condiments are primarily used to flavor and moisten dishes. Some foods used as condiments may also be used during the cooking process. [ 4 ]", "The following index contains ingredients that are commonly used or known as condiments. Because many things can theoretically be used as condiments, the list is not all-encompassing."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ADairy", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Dairy", "url": "https://en.wikibooks.org/wiki/Cookbook%3ADairy", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Dairy", "ingredients": ["Cow's milk", "Thick yogurt", "Buttermilk", "Dairy curds", "Cottage cheese", "Cheese", "Butter", "Quark"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Ingredients | Basic foodstuffs", "Dairy ingredients are generally the products of milk and are used in a variety of different ways. [ 1 ] Almost all of the dairy consumed by humans is derived from domesticated herbivores, such as cows, goats, sheep, buffalo, etc. [ 1 ] Dairy products from cows are most prominent globally, but many cultures and specialty products rely on other animal sources.", "Most dairy products have a white or off-white color and a mild, slightly sweet flavor—the exception is fermented dairy products (e.g. yogurt, cheese), which develop more complex flavors, textures, and colorations as a result of the microbial action on the initial milk or cream. [ 2 ] [ 3 ] Unless the fat has been removed, dairy products are rich, but the final fat content depends on the processing techniques. [ 3 ]", "All dairy products begin with milk , which is then processed in a variety of ways to make different products:", "Most dairy products—especially fresh ones—are perishable, and they must be stored carefully in the refrigerator. Fermented, cured , and pasteurized dairy products have a longer shelf life, but some may still be perishable, depending on the method of production.", "Dairy products have a wide range of uses in cooking, where they typically contribute to flavor and texture. [ 1 ] [ 4 ] Both the proteins and sugars in dairy products can contribute to the maillard reaction , resulting in the generation of browning and complex flavors. [ 2 ] Yeasted products especially benefit from this, as the yeast cannot break down the added lactose. [ 5 ] Dairy products containing fat will also contribute richness, tenderness, and flavor to dishes. [ 2 ] [ 5 ] Fermented dairy products can add acidity. All dairy products will also contribute moisture, although the amount will depend on the specific product.", "People abstain from dairy as a category for a variety of reasons. Health-wise, a large number of adults are lactose intolerant, which requires them to avoid certain dairy products, [ 3 ] most often fresh dairy products where the lactose has not been broken down by fermentation. Individuals may also be allergic to some of the proteins in milk, which typically prevents the consumption of all dairy products. Under the Jewish laws of kashrut , dairy products may not be combined with meat. Vegans abstain from all animal products, including dairy. Individuals with lactose intolerance may need", "Sometimes, different dairy products can substitute for each other, depending on the exact characteristics called for in the original recipe. You'll want to assess the moisture content, fat content, and acidity and choose/modify a substitute to match the original characteristics as much as possible. Similarly, in certain circumstances, dairy products can be substituted by non-dairy ingredients, depending on the function of the dairy in the original recipe. [ 4 ] It will, however, be harder to match the flavor profile and milkfat characteristics."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AFruit", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Fruit", "url": "https://en.wikibooks.org/wiki/Cookbook%3AFruit", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Fruit", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Ingredients | Basic foodstuffs", "This section deals with fruit in the culinary sense rather than the botanical sense. Consequently, items that are botanically classified as fruits, but are often referred to in cooking as \"vegetables\" (e.g. tomato , squash, etc.) [ 1 ] [ 2 ] will be in the vegetables section, and not here.", "There is no universal set of characteristics shared by every culinary fruit. However, fruits do tend to share certain characteristics. For example, they are usually the seeded, fleshy, water-rich products of plants, [ 1 ] [ 3 ] with up to 95% water content in some varieties. [ 2 ] With some exceptions, they tend to be low in fat and protein [ 2 ] [ 3 ] and high in sugar and acidity. [ 1 ] [ 3 ] [ 4 ] [ 5 ] They tend also to be colorful and flavorful.", "All fruits go through a maturation and ripening process. The maturation stage brings them to the proper size and state of development—all fruits must go through this process on the plant. After maturation, fruits then ripen, wherein their color, flavor, and texture develop to their maximum potential. [ 5 ] During this stage, sweetness increases, acidity and astringency decrease, and the fruits become softer and juicier in texture. [ 2 ] [ 5 ] [ 6 ]", "Interestingly, because fruits remain alive for some time after picking, some fruits have the ability to continue ripening after harvest. [ 2 ] [ 5 ] [ 6 ] These are called climacteric fruits , [ 7 ] and they both secrete and react to ethylene gas, [ 2 ] which causes them to proceed through the physical ripening process. By exposing underripe fruits of this type to either artificial ethylene gas or another ripe fruit that is secreting a lot of ethylene, you can cause the underripe fruits to ripen faster. [ 2 ] [ 3 ] [ 8 ] On the other hand, by separating them from other ripe fruits, you can slow the ripening process. [ 2 ] Non-climacteric fruits must be allowed to fully ripen on the plant, as they will not develop further after harvest, [ 7 ] even if exposed to ethylene gas. In fact, exposure to ethylene simply causes these fruits to rot faster as they exhaust their stored reserves. [ 6 ]", "After picking and/or ripening to their peak, fruits will begin to decline, becoming overly soft and discolored, developing off-flavors, and eventually rotting. Colder temperatures will slow both the ripening and the decaying process, [ 2 ] [ 5 ] [ 8 ] so use refrigeration as needed to modulate the fruit's life cycle.", "Many fruits will darken and brown when cut or bruised. [ 1 ] [ 6 ] [ 7 ] [ 9 ] This is called \"enzymatic browning\" and results from the oxidizing action of the phenolase enzyme on certain compounds in the fruits. [ 6 ] While it is perfectly harmless, it can be unsightly. One way to reduce this is by tossing the fruit in citrus juice or acidulated water. [ 2 ] [ 9 ] [ 10 ]", "Because fruits have a wide range of native habitats, characteristics, uses, and phylogenies, it is extremely difficult to divide them into discrete categories. This section addresses a few different ways to classify them."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ALeavening_Agent", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Leavening Agent", "url": "https://en.wikibooks.org/wiki/Cookbook%3ALeavening_Agent", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Leavening Agent", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Ingredients | Basic foodstuffs", "Leavening agents are those components that fill doughs and batters with pockets of gas. [ 1 ] [ 2 ] [ 3 ] [ 4 ] [ 5 ]", "The basic principle of leavening is the incorporation, generation, and/or expansion of gas in(to) a mixture. This leavening is then made permanent by the setting of these gas cells into a more solid structure. Though the exact mechanism of action varies slightly depending on the type of leavening used, the same general process proceeds for all types. First, seed pockets of air are incorporated into a raw dough or batter. [ 6 ] [ 7 ] If not sufficiently aerated, these pockets must then increase in size through the generation and/or expansion of gas, [ 3 ] [ 8 ] which can occur through heat and other processes, depending. [ 6 ] For example, water expands and turns to steam when heated. [ 6 ] The expanded pockets must then set into a sturdy structure before they rupture and gas ultimately escapes from the mixture. [ 3 ] [ 6 ] [ 7 ] If the structure does not set, it will deflate when the gas escapes or shrinks back down. [ 6 ]", "Note that the incorporation of seed air cells in the raw product is critical to texture in baking, since these cells will expand but not develop de novo during baking—too few or too many air cells can impact the crumb and texture of the final baked product. [ 6 ] Since the expanding gases tend to move into existing air cells, [ 3 ] [ 5 ] a small number of cells will create an irregular and coarse structure of pockets. [ 6 ]", "The gases that most commonly play a role during the leavening process are atmospheric air, carbon dioxide gas, and steam, [ 3 ] [ 6 ] [ 7 ] though others can also play a role. Atmospheric air leavens when it's incorporated into a mixture, steam develops when moisture in the mixture is heated, and carbon dioxide can evolve through a few different mechanisms. Individual leavening agents are typically categorized into three main groups—physical/mechanical, biological, and chemical—based on the way the gas pockets develop. [ 2 ] [ 5 ] [ 6 ] [ 9 ]", "The principal and simplest physical leavening agent is room air, [ 6 ] [ 7 ] which is incorporated into the mixture by mechanical agitation. [ 7 ] [ 9 ] Sifting, beating, creaming, and whipping/foaming are all ways of incorporating air pockets into a mixture, [ 3 ] [ 5 ] [ 7 ] [ 9 ] though the amount of air varies by technique and ingredients.", "The second common physical leavener is steam. [ 6 ] As water in the mixture heats up, it turns to steam and expands by over 1000 times, [ 3 ] [ 6 ] expanding the air cells in the process. Any water-containing ingredient (e.g. eggs, milk, etc) will contribute to the steam. [ 6 ] [ 7 ] Note that the oven must be properly hot for maximal evaporation and steam leavening, [ 3 ] [ 6 ] and preparations leavened mainly by steam usually need to be cooked in a fairly hot oven. [ 6 ] [ 9 ] Choux pastry and puff pastry are examples of products leavened almost entirely by steam. [ 3 ] [ 5 ] [ 6 ]", "This type of leavening is done primarily by yeast, [ 3 ] which ferment sugars and produce carbon dioxide gas as a byproduct. [ 3 ] [ 6 ] [ 9 ] This carbon dioxide expands the air pockets and leavens the mixture. [ 3 ] Among the leaveners, biological leavening is somewhat slow, requiring long rest periods to allow the fermentation to take place. [ 9 ]"], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AMeat_and_poultry", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Meat and poultry</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3AMeat_and_poultry", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Meat and poultry</span>", "ingredients": ["Cookbook:Meat"], "steps": [], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AOil_and_fat", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Oil and fat</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3AOil_and_fat", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Oil and fat</span>", "ingredients": ["Cookbook:Oil and Fat"], "steps": [], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ANuts_and_seeds", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Nuts and seeds</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3ANuts_and_seeds", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Nuts and seeds</span>", "ingredients": ["Cookbook:Nuts and Seeds"], "steps": [], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ASeafood", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Seafood", "url": "https://en.wikibooks.org/wiki/Cookbook%3ASeafood", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Seafood", "ingredients": ["The Monterey Bay Aquarium's Seafood Watch Program offers suggestions on what seafood to choose based on environmental impact and fishery health."], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Ingredients | Basic foodstuffs", "Seafood is derived from aquatic animals, such as fish, mollusks, and crustaceans. These animals provide protein in many diets around the world. The harvesting of seafood is called \"fishing. \"", "The term is not restricted to sea creatures, but may include fresh-water animals as well. This class of foods, perhaps unexpectedly to some, may also include land snails.", "The plants of the sea are often also edible, including nori , which is actually a type of algae, and is usually classified as a vegetable, rather than a seafood."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ASpices_and_herbs", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Spices and herbs</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3ASpices_and_herbs", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Spices and herbs</span>", "ingredients": ["Cookbook:Herbs and Spices"], "steps": [], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ASweeteners", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Sweeteners", "url": "https://en.wikibooks.org/wiki/Cookbook%3ASweeteners", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Sweeteners", "ingredients": ["White sugar", "Brown sugar", "A magnified view of sugar crystals"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Ingredients | Basic foodstuffs", "A sweetener is a food additive which adds the basic taste of sweetness to a food; it may come from a natural source or it may be artificially manufactured."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AVegetable", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Vegetable", "url": "https://en.wikibooks.org/wiki/Cookbook%3AVegetable", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Vegetable", "ingredients": ["Fruit", "Nut", "Fungus"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Ingredients | Vegetables | Basic Foodstuffs", "The vegetables commonly used in cooking are listed below. Note that some vegetables that are botanically fruits are still considered to be vegetables in the culinary sense and are listed here.", "For a complete list of vegetables, see Category:Vegetables or browse below:"], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AAppetizers", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Appetizers</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3AAppetizers", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Appetizers</span>", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages", "Appetizers are dishes served before a meal or at a cocktail party or other informal occasion.  They are often referred to as snacks or hors d' oeuvres .", "In general, appetizers are intended to be eaten by hand in a bite or two, or at least be capable of being cut with the side of a fork, rather than a knife.  Since appetizers are a customary course in French and Italian cooking, among other styles of cooking, it is fairly easy to find haute cuisine recipes for appetizers.", "Arguably, one fundamental, unspoken, purpose of appetizers, especially in a restaurant setting, is to keep hungry people fed until the main dish is served.", "In a home setting, people who might have trouble getting the main meal on the table in a timely fashion on a particular day, such as a holiday, might especially want to have planned in advance to serve an appetizer of some type or sort.", "One of the most fundamental appetizer categories in modern times, ignoring haute cuisine, is the dip and carrier combination, of which the variations are endless.", "For a complete, automatically generated list of recipes, see Category:Appetizer recipes , or browse the subcategories below."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ABreakfast", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Breakfast</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3ABreakfast", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Breakfast</span>", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages", "Breakfast is the first meal of the day, eaten in the morning to break the fasting period of sleep. Breakfast traditions vary greatly around the world, from the minimal Café au lait of France to the hearty spreads of the substantial English Breakfast . A breakfast should provide enough energy to realize the daily activity until noon or lunch but it should also be light enough as to be easy to digest.", "For a complete, automatically generated list of recipes, see Category:Appetizer recipes , or browse the subcategories below."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ADessert", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Dessert</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3ADessert", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Dessert</span>", "ingredients": ["Brownies", "Cheesecake", "Cookies", "Pie", "Galaktoboureko"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages", "Typically, a dessert is a food that comes at the end of a meal. Its taste is usually sweet, but sometimes strong, as with many cheeses. The word comes from the Old French desservir , meaning \"to clear the table.\" Common desserts include cakes, cookies, fruits, pastries, pies, ice cream, and candies."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ASpecial_Diets", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Special Diets", "url": "https://en.wikibooks.org/wiki/Cookbook%3ASpecial_Diets", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Special Diets", "ingredients": ["Atkins Diet Cooking (Weight-loss; Low Carb )", "Caloric Restriction with Optimal Nutrition (General health, life-extension)", "Eat Clean Diet (Weight-loss; No preservatives)", "Gluten-Free (Wheat-, barley-, and rye-free)", "High Protein Diet (Weight-loss)", "Halal food (Religious)", "Karma Free (Religious)", "Kosher food (Religious)", "Lactose-free Cooking (Allergies; free of unfermented and untreated milk)", "Low-allergen Cooking (Allergies)", "Low Carb Cooking", "Low-fat Cooking (General Health)", "Low-GI Diet (Diabetic)", "Low-sodium Cooking (General Health)", "Macrobiotic Cooking (General Health)", "Paleolithic (Paleo) Diet (General Health)", "Pritikin Cooking (Weight-loss)", "Raw Diet (Ethical; Religious; General health)", "South Beach Diet Cooking (Weight-loss; Low-GI/GL)", "Vegetarian cuisine (Ethical; Religious; General Health)", "Vegan cuisine (Ethical; Religious; General Health)", "Weight Watchers Recipes (Weight-loss)"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Special diets", "Food is an individual preference, but often there are medical reasons for choosing a particular special diet. Other people are trying to lose or maintain weight, or dealing with food allergies, or have ethical or religious preferences that dictate the foods they will eat. The following is a list of major diets and the reasons for following those diets."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ALow-Carb", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Low-Carb", "url": "https://en.wikibooks.org/wiki/Cookbook%3ALow-Carb", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Low-Carb", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Special diets", "Low-carb diet is a general term referring to numerous specific diets that advocate for a reduction of carbohydrate intake as a healthier balance of foods. The concept is based on the fact that grain -based foods cause the body to store the fat it consumes rather than burning it for fuel. Low-carb diets, in various prescriptions, favor \"complex carbs\" (vegetables) over \"simple carbs\" (grains and starches), while also reducing the consumption of saturated fat in favor of unsaturated fat .", "The Atkins Diet is the most well-known and heavily marketed low-carb diet, though its specified prescriptions for regimented protein intake are controversial. The South Beach diet is also well known, though more generalized. The Zone diet is controversial because it prescribes a balance between carbs, fat, and protein according to a \"40:30:30\" ratio.", "It's important to note that both the Atkins and Zone diets are controversial due to the specific claims or prescriptions they make. Further, both are business trade names for diets and are considered proprietary and licensed franchises (though to a different degree). However, the basic general principles of low-carb dieting are not intellectual property, and likewise, the general ideas about proportions and balance in these specific diets are free to examine and learn from."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AGluten-Free", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Gluten-Free", "url": "https://en.wikibooks.org/wiki/Cookbook%3AGluten-Free", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Gluten-Free", "ingredients": ["Amy's Kitchen produces gluten-free soup in cans. Amy's tests every batch of gluten free products to 20ppm to ensure that they are Gluten Free.", "Campbell's Soups are not gluten-free; wheat is used as a thickener.", "Pacific and Imagine soups produce many gluten-free broths and soups packaged in cartons.", "Progresso soups label foods that contain the top allergens such as wheat, milk, eggs, soy, etc.; some are gluten-free. Always read ingredient labels. Pearled barley is barley, and is not gluten-free.", "Thai Kitchen produces soup in cans and rice noodle/broth packages; many are gluten-free, always check labels."], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Special diets", "Gluten is a protein most notably found in wheat , but also present in a number of other common grains .  It permits the flexibility of wheat flour as a baking material.  Gluten's elasticity allows the cells that form in bread, and keep baked goods from crumbling.  The elasticity of gluten increases when it is worked and decreases if it is permitted to rest.", "Gluten is present in the following grains: wheat (including spelt and triticale ), barley , and rye and almost any foods made therefrom; although oats are not themselves dangerous they are (certainly in the USA) contaminated to some degree with wheat and must be, at best, a suspect ingredient.  Gluten may be present in many unexpected places. Fermented, undistilled alcoholic beverages made from these grains do contain gluten, as may such seemingly innocuous products as cold cuts, soy sauce , or hard candies. Additionally, many ingredients that are commonly found in processed foods, such as modified food starch, can be made from wheat and therefore contain gluten.", "Another place you will find gluten, though not obvious, is in the production of many foods that do not contain wheat or substances in their ingredients. One common example of this are foods that do not contain gluten in their recipe, but the conveyor belts where the food is processed is dusted with flour to prevent sticking. Many \"energy bars\" fit this description.", "There is no other way to know if this is the case by reading the label; you must call the vendor to be sure.", "This diet is necessary for those with gluten sensitivity, gluten intolerance and auto-immune diseases like Celiac Disease . A gluten-free diet can be useful for those suffering from an allergy to one or more of the grains (mainly wheat, barley and rye) this diet excludes. There are over 190 medical conditions that have been linked to gluten sensitivity and gluten intolerance, Celiac Disease being one of them.  Celiac Disease is often still undiagnosed. Some people find that a gluten-free diet is beneficial for children with autism . It should be noted, however, that there is no evidence for an autism-gluten link. A distinction is important, because wheat and gluten are high quality food sources, not to be rejected on the basis of unfounded speculation.", "It is important to note that Celiac Disease is NOT itself an allergy, but an auto-immune disorder - the body rejects its own digestive proteins used to process gluten and produces antibodies against them. In essence, the body is fighting itself, in the presence of gluten, and doing damage to the small intestine in the process. Celiac Disease becomes a two-fold issue due to the damage done to the villi in the small intestine creating a nutrient malabsorption problem that is not reversible.", "Careful and constant reading of ingredients is necessary to purchase truly gluten free foods. If flour (which means \"wheat flour\" unless otherwise specified), starch (including \"modified food starch\", \"food starch\"), malt, or any grain containing gluten is present, do not purchase the food. Unfortunately for the person with gluten sensitivity or gluten intolerance, it may be necessary to also investigate every step of the handling of the products, due to widespread wheat contamination of certain foods by way of shared equipment, containers, and processing rooms. Cross contamination is a big issue that many do not think about when it comes to storing, handling and preparing food.  Finally the utensils, equipment, and surfaces for cooking and eating must be free of accumulations containing gluten, especially ones which have been hardened on by heat, especially in toasters and bakeware."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AEating_for_Health", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Eating for Health", "url": "https://en.wikibooks.org/wiki/Cookbook%3AEating_for_Health", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Eating for Health", "ingredients": ["Your diet choice is no good if you don't think you can follow it long-term.", "Your diet choice doesn't make up for smoking, lack of exercise, or any other bad habit; however, a healthful diet is a critical ingredient for a healthy body and you will enjoy many benefits from making good eating decisions."], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Special diets", "A healthful diet brings many benefits. It can help one avoid cancer and heart disease, control weight, and avoid diabetes. A healthful diet can also have effects on mood.", "In choosing a healthful diet, you must start with two important concepts:", "Not everyone is trying to lose weight, but as an example, suppose that you are. Suppose that you eat a delicious treat. Would you consider yourself a failure? You shouldn't!  Allowing thoughts of failure may only give you an excuse to give up on healthy eating.", "If you are trying to lose  weight, cutting down the treats and making sure you eat plenty of vegetables may help.  Beyond diet, losing weight depends on your activity level.  If your calorie intake (food) exceeds your calorie output (activity) your body will store the excess calories as fat.  Weight loss requires your calorie intake to be lower than your calorie output, though neither should be done in the extreme.", "Choose a different attitude.  Don't think of healthy eating as a \"diet\". Think of healthy eating as balanced eating. Healthy eating is a lifestyle and one that you should enjoy.  You will have difficulty eating well if you don't like the food.   Get yourself in the habit of making good dietary choices by trying different foods as well as different ways to prepare them to find healthy foods that appeal to you.", "One last thought, eating healthily does not mean starving yourself!  If you are hungry, eat.  Just be smart about what you take in.  Reach for apples or celery over candy bars or chips.  You don't need to feel like you have to cut out completely the occasional treat — just keep it that: occasional.", "Diet is hardly your main problem if you won't exercise. As with following a good diet, exercise is best if you can work it into your daily schedule. For example, try taking the stairs instead of the elevator whenever possible. Consider biking to work instead of driving."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AHalal", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Halal", "url": "https://en.wikibooks.org/wiki/Cookbook%3AHalal", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Halal", "ingredients": ["All types of fish are halal, and don't have to be slaughtered. Shi'ites do have a restriction against shellfish, but Sunnis do not."], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Special diets", "Halal (حلال‎) is the Arabic word for 'allowed' or 'permissible', and is used as a generic term used to describe anything which is lawful or allowed in Islam. Halal is a label given to foods which are ceremonially slaughtered according to Muslim traditions, as stated in the Qu'ran.  It is similar to the Jewish tradition of Kosher food (i.e., pork is not allowed), and has a common origin in early monotheistic scripture.", "Muslims are only allowed to eat meat from animals or birds which have been slaughtered in a particular fashion. The animal must be cut with a sharp knife across the neck in such a fashion that its blood is drained. During the slaughtering, Allah's name is also mentioned as a way of showing gratitude."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AHigh_Protein_Diet", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:High Protein Diet", "url": "https://en.wikibooks.org/wiki/Cookbook%3AHigh_Protein_Diet", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:High Protein Diet", "ingredients": ["Protein is essential for building muscle.", "Unlike carbohydrates, protein provides long-lasting energy without an insulin surge (which promotes fat storage).", "Protein tends to suppress the appetite.", "Protein takes quite a bit of energy to digest, which boosts the body's metabolism.", "Lean protein-rich foods are much less calorie-dense than carbohydrate-rich foods. For example, the ham in a common sandwich may have 343 kJ per 100g, whereas the bread has 1011 kJ per 100g. Like vegetables , they help to bulk out a meal."], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Special diets", "A High Protein Diet is often recommended by bodybuilders and nutritionists to help efforts to build muscle and lose fat. It should not be confused with low-carbohydrate diets such as the Atkins Diet , which are not calorie-controlled and which often contain large amounts of fat.", "High Protein diets typically obtain 30%–60% of their calories from protein , 15%–30% from fat and the remainder from carbohydrates . They tend to rely heavily on seafood and lean meat, which makes them difficult or impossible for vegetarians .", "The daily food intake that is detailed below contains 1250 kCal in total, and would therefore be suitable for someone with 45 kg of lean bodyweight—such as a 60 kg female with 25% bodyfat—who wants to lose weight at a rate of ¼–½ kg a week (the maximum safe rate). Individuals with a greater lean bodyweight should increase their food intake proportionately, as should lean individuals who are attempting to gain weight. 50% of the calories come from protein, 25% from carbohydrates and 25% from fat.", "Anyone attempting to reproduce this diet should try to find products that match the nutritional profiles shown below. The protein, carbohydrate and fat content is given as their percentage by weight, which is the same as grams per 100g (as marked on nutritional labels). This is not the same as the percentage of calories.", "A multivitamin supplement should be taken to ensure that adequate levels of each essential vitamin and mineral are maintained.", "Some of the milk can be put towards cups of coffee or tea throughout the day. If required, artificial sweeteners should be used instead of sugar. Milk is an important weapon against osteoporosis, not just because of its calcium content, but because it also contains enzymes that promote bone growth.", "In order to achieve the recommended six meals a day, one sandwich should be eaten mid-morning, one at lunchtime and one mid-afternoon. Soya/linseed bread has very low Glycemic Index (36), which also helps to ensure a steady release of energy during the day. Lettuce or sliced tomato may be added to make the sandwiches more interesting."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AKosher", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Kosher", "url": "https://en.wikibooks.org/wiki/Cookbook%3AKosher", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Kosher", "ingredients": ["Any fish that has both scales and fins. This means that shellfish are not kosher, and neither are fish like catfish."], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Special diets", "Kosher refers to that which is prepared in accordance with Jewish law. Kosher foods are foods that practicing Jews are allowed to consume. The specific rules are enumerated in the Torah and refined in the Talmud. There are two groups of rules: what can be eaten and how it can be prepared.", "The U or K within a circle are two of many symbols used by Jews in the USA to identify kosher products. A \"plain k\" [a K all by itself] does not mean that the food is certified kosher, but rather that the company declares it to be kosher. Many Jews do not accept \"plain k\" as a legitimate kashrut certification. Some Jews will not accept certain certifications, as interpretations and levels of observance vary from Jew to Jew.", "If you are entertaining for people that you know or think may keep kosher, be sure to ask them about their personal rules, as there are many interpretations and subtle variations.  Depending on their observance, they may be fine eating a vegetarian dish cooked in your home, or may not be comfortable doing anything more than eating unprepared fruit. Strict Kashrut includes categorizing the cooking vessels, the serving containers, the cutlery and the cooking surfaces as kosher or non-kosher as well.  Generally, if a pot has been previously used to cook non-kosher meat, one cannot use it to produce a kosher meal.", "Holidays from an important part in the Jewish life, and have many special foods and meals associated with them. Passover in particular has an entire cuisine, due to the prohibition of leavened breads. For recipes that are kosher specifically for Passover, see Category:Passover recipes ."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ALow-GI_Diet", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Low-GI Diet", "url": "https://en.wikibooks.org/wiki/Cookbook%3ALow-GI_Diet", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Low-GI Diet", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Special diets", "Low-GI diet refers to a diet that advocates consumption of foods with a low glycaemic index (GI).  The glycaemic index measures the rate at which the body converts the carbohydrate in a given food to glucose (blood sugar).  A low-GI diet is useful for people with diabetes, as either their bodies' insulin production is deficient or their bodies are insulin resistant, restricting their ability to metabolise glucose. Thus a lower GI diet causes less variation in blood glucose levels which makes the condition easier to manage.", "Low-GI diets have benefits for non-diabetics also.  A high-GI diet results in peaks and troughs of energy throughout the day, whereas a low-GI diet results in a good level of sustained energy.  Low-GI foods also tend to have a longer satisfaction period per calorie given the slow energy release, which is useful in maintaining a healthy weight loss/control diet.", "It should be noted that, since the glycaemic index measures the rate at which the carbohydrate in the food is converted into glucose, it can be misleading for foods with a low quantity of carbohydrate. The carbohydrate in carrot has a medium GI but, since a carrot only is about 7% carbohydrate, it has a relatively small effect on the blood glucose.  For this reason, some people advocate use of the glycaemic load (GL) instead, which is simply the GI divided by 100, times the quantity of carbohydrate (in grams).", "Foods such as meat which have no carbohydrate have no GI.", "A GI of up to 55 is low, 56-69 medium and 70+ high.  Glucose has a GI of 100.", "A GL of 10 or less is low, 11-19 medium and 20+ high."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AVegan_cuisine", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Vegan cuisine</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3AVegan_cuisine", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Vegan cuisine</span>", "ingredients": ["Cookbook:Vegan Cuisine"], "steps": [], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AVegetarian_cuisine", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Vegetarian cuisine", "url": "https://en.wikibooks.org/wiki/Cookbook%3AVegetarian_cuisine", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Vegetarian cuisine", "ingredients": ["Cinnamon Roll", "Crispy Sweet Potato Fries", "Falafel", "French Fries", "Fresh Mozzarella Bruschetta", "Grape leaves", "Grits", "Hush Puppies", "Inarizushi", "Kovaim", "Latkes", "Samosa", "Sauerkraut", "Stroopwafels", "Tomatoes with Cheese Stuffing", "Plantain Chips with Cayenne (Kelewele)", "Pierogi", "Popcorn", "Pretzel", "Vegetable Spring Roll", "Vegetarian Meatballs", "Roasted Eggplant", "Roasted Rice Cakes of Japan (Mochi)"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Special diets | Cuisines", "People may choose to become vegetarian for a variety of reasons , and meat-eaters may eat vegetarian meals.", "In North America, one is considered a vegetarian if one does not eat animal meat .  In some parts of the world, people who call themselves vegetarians do eat fish and/or seafood; in North America these people would be referred to as semi-vegetarians or pescetarians. If you are traveling abroad, or if you are entertaining foreign vegetarians, be sure to verify that you are communicating the correct meaning of 'vegetarian'.", "Some vegetarians do eat eggs and/or dairy products, although it is important for vegetarians to note that many soft cheeses, especially French cheeses, may contain animal rennet which is obtained from calf stomachs (and is therefore not considered vegetarian). Those who do not eat any animal products are called vegans; see vegan cuisine . Vegan recipes are always vegetarian.", "Non-vegetarians often eat vegetarian meals without labelling them as such (many pasta dishes, dahls, veggie burritos, and virtually all desserts).", "According to the American Dietetic Association , \"appropriately planned vegetarian diets are healthful, nutritionally adequate, and provide health benefits in the prevention and treatment of certain diseases.\"  The main requirement for vegetarian nutrition is to ensure your diet contains a wide variety of grains, vegetables, and legumes, and to a lesser degree fruits, nuts, and seeds.  It is a common misconception that vegetarian diets provide inadequate protein.  While one person's protein requirements may be very different from another's, the ADA has found that a typical varied vegetarian diet that meets one's energy needs, also meets one's protein requirements.  Even athletes, whose protein requirements are typically greater than non-athletes, can fare well on a vegetarian diet.  The ADA found that \"vegetarian diets (except possibly fruitarian and strict macrobiotic diets) can easily meet the nutritional requirements of all types of athletes provided they contain a variety of plant-foods.\"  ( see ADA article )", "As a general rule, two or more different vegetarian protein sources should be eaten in a day to ensure that the body gets all the essential amino acids it needs. The only complete (containing all essential amino acids) plant protein is soy, found in products like tofu. Animal products, like eggs and cheese, are also complete proteins, but vegetable protein sources (e.g. beans, chickpeas, lentils, nuts) other than soy are all incomplete proteins and must be eaten in combination.", "The Vegetarian Society has a page on vegetarian nutrition ."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AEquipment", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Equipment", "url": "https://en.wikibooks.org/wiki/Cookbook%3AEquipment", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Equipment", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Cookbook equipment", "Various types of equipment are used in a kitchen.  One of the Wikibooks Cookbook's goals is to have an article on each, including uses, alternative equipment if you don't have the exact item, and a buying guide.", "Kitchen hand tools are small, hand-held tools that aid in cutting, slicing, stirring, combining, moving and serving. They usually have no or very few moving parts. Hand tools should be selected for sturdiness, durability, and safety.", "The list of hand tools used in the kitchen is seemingly endless. Stick to the what you need for the kind of cooking you do. Add new ones carefully to avoid a drawer full of tools you don't need. \"Time-saving gadgets\" are usually single-purpose tools whose cost far exceeds their usefulness. For example, a mandoline is very useful if you slice a lot of vegetable frequently or you need uniform slices for appearance; however, the time getting it out, setting it up and cleaning after use is not time very well spent if you are making a single salad.", "Appliances are larger tools, either with a power source (such as electricity) or a more complex design with moving parts.", "Appliances tend to be expensive, and in some cases, such as refrigerators and ovens, they may be built into the kitchen, which means you get little choice about which type to have.  Even when you buy the appliance, you will probably only get one, or sometimes two, so you should consider your actual needs, including portability and storage.  Many appliances can help you cook a variety of foods.  For example, an electric blender can be used to purée baby food, soup, fruit smoothies, and milkshakes, as well as to mix thin batters and sauces.", "Pots and pans are necessary for most kinds of cooking.  The number and type you need depend on what you want to cook, but most home cooks need a small number:  a larger pot for boiling pasta or making soup, a frying pan for everyday cooking, and a sheet pan or casserole dish to go in the oven.  Your cooking appliances may require a specific type of cookware.  For example, induction ranges require metallic pots with perfectly flat bottoms, and microwave ovens require non-metallic, microwave-safe dishes.", "To create a new equipment page yourself, enter your title directly behind the Cookbook prefix below."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ACookware", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Cookware", "url": "https://en.wikibooks.org/wiki/Cookbook%3ACookware", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Cookware", "ingredients": ["crepe pan", "Double boiler", "Dutch oven", "Frying pan", "Makiyakinabe pan", "Paella pan", "Roasting pan", "Pressure cooker , including multicooker as Instant Pot .", "Saucier Pan", "Saucepan (typically called a \"2-quart (2 L) pot\" or \"4-quart (4 L) pot\")", "Sauté pan", "Stock pot", "Tava", "Wok"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Cookbook equipment", "Cookware holds food, generally for cooking on a range . Sometimes pots and pans are used in an oven or, if they do  not include metal, in a microwave .", "Dark gummy burned-on oil can be removed with acetone, widely available from hardware stores and in diluted form as nail polish remover.", "Cookware and bakeware are containers in a kitchen for food preparation. Cookware are for use on a stove or range cooktop. Bakeware are for use inside an oven. Some utensils are used for both types of cooking.", "There are many types of cookware and bakeware. The material are constructed affects the quality of the vessel and the quality of the food cooked. Factors to consider are the thermal conductivity, how food sticks in use, and the surface pre-preparation, i.e., seasoning, before use.", "A factor to consider in selecting is the heat conductivity of the handle. If it is molded to the vessel of the same material Then precautions need to be followed in handling the vessel when hot. Avoid hollow handles because they are difficult to clean or dry. Additionally, a good cooking pot design has an \"overcook edge\" where the lid actually rests and the lid has a dripping edge that prevents condensation fluid from dripping from the lid when handling.", "Metal pots need to conduct heat well and be chemically unreactive to avoid altering the flavor of the food being cooked. These two factors are usually mutually exclusive and the vessel is a compromise between them.  Clad vessels are attempt to get the bes of both.  For example a copper pot clad or tinned with another metal.", "Stainless steel is good enough for most uses, although it is not as conductive as aluminium or copper. Stainless steel tends to be inexpensive and lightweight. Stainless steel has the advantage of being non reactive with most household acids. Thin-bottomed pans, often with an insignificant layer of copper, can cause uneven heating, so a layer of aluminium is often \"sandwiched\" in the base of the pan."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AEquivalencies", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Equivalencies</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3AEquivalencies", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Equivalencies</span>", "ingredients": ["Apple :"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages"], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AInternational_food_terms", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">International food terms</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3AInternational_food_terms", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">International food terms</span>", "ingredients": ["Cookbook:International Food Terms"], "steps": [], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ASeasonality", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Seasonality</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3ASeasonality", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Seasonality</span>", "ingredients": ["http://www.whfoods.com/genpage.php?tname=faq&dbid=28", "http://www.rivercottage.net/whatsgoodnow/seasonalitytable_hub.jsp", "http://www.foodland.gov.on.ca/english/availability.html"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages", "The seasonality of an ingredient refers to the period in which the ingredient is available or is at its best. Some ingredients, such as asparagus , are only available several months of the year whereas others, such as cabbages or carrots are available fresh all year long.", "These days, there are many ways to get ingredients out of season. Some ingredients, like apples , will simply keep for a very long time, without much extra effort. Others, such as peas , can be frozen directly after harvest to make them available all year round. Other options include growing vegetables and fruit in greenhouses to simulate seasonal conditions or flying produce in from parts of the world where the seasons are reversed (ie. the season for asparagus on the southern hemisphere is six months later than on the northern hemisphere).", "Because of the measures that are taken to increase availability of ingredients out of season, buying ingredients according to their season has some advantages:", "The following tables show the seasonality per ingredient for each month.", "As the seasonality of ingredients depends greatly on the climate in which they're produced, these tables are intended to be used as a loose guideline. Depending on the location, the season may be longer or shorter.", "When buying ingredients, check the country of origin if possible. Locally produced vegetables that are far out of season are likely to have been grown in greenhouses.", "Turkeys are often eaten for thanksgiving in the fall just after fattening up in the summer. Pigs and other animals are also often slaughtered in the fall after freshly fattened up. Ham is traditionally paired up with the autumn apples. Salmon are popular according to their spawning cycles. In Portugal sardines are a famous festivity as Saint Anthony's day in the summer days of June."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ASubstitutions", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Substitutions</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3ASubstitutions", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Substitutions</span>", "ingredients": ["1/2 cup evaporated milk", "1/2 cup water"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages", "Leave to curdle for 10-20 minutes if possible."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AUnits_of_measurement", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Units of measurement", "url": "https://en.wikibooks.org/wiki/Cookbook%3AUnits_of_measurement", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Units of measurement", "ingredients": ["ml or mL , also milliliter , millilitre , cc (cubic centimeter)", "l or L , also liter , litre ,", "dl or dL , also deciliter , decilitre"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Units of measurement", "Recipes from different parts of the world use different units of measurement . This page is a guide to those that are most commonly used in cooking which follow metric units , imperial units , and US customary units .", "Metric units are made up of a base unit and a scale modifier . Each type of measurement has its own base unit. The modifiers are shared between all units. The relevant base units for cooking are:", "In cooking the old unit Liter (l) is commonly used to measure volume. One liter is (exactly) equal to 0.001 cubic meters, or 1 cubic deci meter, written like: 1 l = 1 dm 3 . The prefix modifiers can be used with any unit and thus 1 cl (centiliter) is equal to 1/100 of a liter. The unit for volume is derived from the unit for length. Two lengths forms an area , which is length x length and has the derived unit square meter (m 2 ). Three lengths forms the volume metric m 3 . This has the consequence that a m 3 is equal to 1000 dm 3 , that is 10 3 = 10x10x10.", "Some recipes in Wikibooks Cookbook use American measurement units ( pounds and ounces, Fahrenheit, fluid ounces and pints, etc. ) and some recipes use metric units ( grammes and kilograms, Celsius, milliliter, etc. ).  An attempt to ensure that all Cookbook recipes use metric units (alone or alongside American units) is an ongoing job.  A list of recipes which have been confirmed as having metric units can be found here .", "Approximate conversions based on water density.\nThese conversions are useful for more than just water.  \nAlthough other things have different densities, they are good enough\nfor most estimates.", "Water has a density of exactly 1 g/cm³", "An American stick of butter is 1/4 lb, and is divided into 8 tablespoons. So, 1 tbsp butter = 1/2 oz butter."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ACooking_Techniques", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Cooking Techniques</span>", "url": "https://en.wikibooks.org/wiki/Cookbook%3ACooking_Techniques", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Cooking Techniques</span>", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages", "Cooking techniques or culinary techniques , the ways in which food and beverages are prepared, combined, heated, cooled, stored, and presented, are numerous and reflect the long historical development cooking has had alongside the growth of human culture and society .", "Below offers an overview of these techniques. As each culture and society influences the ways in which we prepare our food, it is important to recognise that this is not a complete list and is also heavily Western-influenced. As well as this, cooking itself is on a spectrum between being an art as well as a science. This creates some techniques that are more guidelines or advice, whilst others must be followed carefully if the desired outcome is to be achieved.", "The first steps in cooking are usually preparatory, and this stage involves a range of techniques. Basic prep often requires measuring , cutting , mixing , and seasoning . Sometimes combined ingredients must sit for a period of time, as in marinating , macerating , brining , steeping , degorging , and proofing . Coatings may be applied to pieces of food through brushing , basting , and dredging .", "Heating is an important part of many types of cooking. It is what breaks down starches, fibers, and connective tissues, coagulates proteins, gelatinizes starches, and contributes flavor and color through browning and caramelization . It also kills many pathogens that cause food-borne illness.", "A variety of methods are used to heat and cook foods. These can generally be divided into two types, with some exceptions: moist heat methods and dry heat methods. Moist heat cooking relies on liquid water or steam to cook the food, and it includes boiling , simmering , scalding , poaching , stewing, and blanching . Instead of moisture, dry heat cooking uses hot air or fat to cook the food; it includes baking , roasting , grilling , broiling , barbecuing , searing , toasting , smoking , and frying . Other methods that rely on a combination or neither of these two methods include braising , microwaving , thermal cooking , and sous-vide cooking .", "In some cases, very gentle application of heat is desired. This can be achieved by using a bain-marie or double boiler , or by tempering a mixture.", "Food is inherently highly perishable. As such, cooks have developed methods to delay this process and extend the shelf-life of foods. Storage in a cold environment, for example, can significantly delay growth of pathogens, and freezing and refrigeration have become widespread in many kitchens. At the other extreme, canning uses heat to sterilize foods before sealing them away from the external environment to prevent spoilage. Many preservation techniques have the added benefit of altering the flavor and/or texture of the food, such as in fermenting , curing , pickling , smoking , and drying ."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ABaking", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Baking", "url": "https://en.wikibooks.org/wiki/Cookbook%3ABaking", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Baking", "ingredients": ["Blind baking", "Shirring", "Clay Pot Cooking"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Cooking techniques", "Baking is cooking food in an oven with dry heat applied evenly throughout the oven and is synonymous with roasting . Although it is common in some cultures to use the term baking for the so-called baked-goods, such as breads , cakes and pastries , and 'roasting' for other foods, such as meats and vegetables, the terms can also be used interchangeably.", "The dry heat of baking causes the outside of the food to brown or char, giving it an attractive appearance and pleasing taste. The browning is caused by caramelization of sugars and is the result of the Maillard reaction. Despite common misconceptions about the browning process, moisture is never entirely sealed into the food. Over time an item being baked will continue to lose moisture. This can be an advantage, especially in situations where drying is the desired outcome, for example in drying herbs or in roasting certain types of vegetables . Where drying is not desired, a protective layer of butter , oil , or, in the case of breads and pastries, egg wash , can slow the loss of moisture as well as providing flavor and additional browning. Alternatively, some foods are replenished with moisture during baking by placing a small amount of liquid (such as water or broth ) in the bottom of the pan and letting it steam up into or around the food.", "\"Starch gelatinization in bread doughs and cakes forms an important part of the supporting structure of baked goods\" [ 1 ]", "\"During baking, heat and mass transfer takes place in the dough simultaneously and interde- pendently, and involves four major changes:", "1. Gases are vaporized as the temperature increases: the gas cell increases in volume provided that the cell wall retains gases and is deformable.", "2. Starch gelatinizes as temperature increases to an extent depending on the local availability of water; proteins coagulate. These changes limit the dough extensibility.", "3. The initial structure with closed gas cells separated by dough walls is transformed into a porous structure with interconnected pores, known as the dough–crumb transition."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ABlanching", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Blanching", "url": "https://en.wikibooks.org/wiki/Cookbook%3ABlanching", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Blanching", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Cooking techniques | Boiling", "Blanching is a cooking technique involving boiling food (usually vegetables and fruits ) in water for a very short time.  Blanching is often followed by plunging the food into ice water to stop the cooking process.  Though the word means to make something white or pale, blanching certain vegetables like broccoli will make their colors more vivid.", "Blanching is commonly used to remove skins from tomatoes and almonds .", "Vegetables are often blanched prior to freezing or canning. This helps preserve the food by slowing down or halting enzyme action that causes foods to break down, losing color, flavor, and nutritional value.", "Blanching is similar to parboiling , which also involves boiling food briefly in water.  Certain vegetables may benefit from being blanched or parboiled before being stir-fried . One quick way to blanch vegetables is to boil fresh vegetables in water, with salt, for about 30 seconds to 1 minute, before immediately draining and freezing them."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ABoiling", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Boiling", "url": "https://en.wikibooks.org/wiki/Cookbook%3ABoiling", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Boiling", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Cooking techniques", "Boiling , as it applies to cooking, means cooking foods in boiling water. In most populated parts of the world, plain water boils at temperatures from about 200°F to 212°F (95°C to 100°C). This varies with the atmospheric pressure, which in turn varies with both altitude and weather. When the water is salted, the boiling temperature is slightly higher than for clean water.", "When the atmospheric pressure on the surface of the water is lessened, boiling takes place at a lower temperature than that mentioned, and in extremely high altitudes the boiling point is so lowered that to cook certain foods by means of boiling water is difficult. As the water heats in the process of boiling, tiny bubbles appear on the bottom of the vessel in which it is contained and rise to the surface. Then, gradually, the bubbles increase in size until large ones form, rise rapidly, and break, thus producing constant agitation of the water.", "Boiling has various effects on foods. It toughens the albumin in eggs, softens the fiber and dissolves the connective tissues in meat, softens the cellulose in cereals, vegetables, and fruits, and dissolves other substances in many foods. A good point to bear in mind in preparing foods by boiling is that slowly boiling water has the same temperature as rapidly boiling water and is therefore able to do exactly the same work. However, certain recipes may specify rapid boiling or slow boiling due to other conditions (such as not wanting to disintegrate soft food, or wanting to make use of the bubbles that appear in rapid boiling).", "Turning the stove on high, keeping the gas burning full heat, or running the fire hard to keep the water boiling rapidly is therefore unnecessary; besides, it wastes fuel without doing the work any faster and sometimes not so well. However, there are several factors that influence the rapidity with which water may be brought to the boiling point; namely, the kind of utensil used, the amount of surface exposed, and the quantity of heat applied.", "A cover placed on a saucepan or a kettle in which food is to be boiled retains the heat, and thus causes the temperature to rise more quickly; besides, a cover so used prevents a loss of water by condensing the steam as it rises against the cover. As water boils, some of it constantly passes off in the form of steam, and for this reason syrups or sauces become thicker the longer they are cooked.", "The evaporation takes place all over the surface of the water; consequently, the greater the surface exposed, the more quickly is the quantity of water decreased during boiling. Another point to observe in the boiling process is that foods boiled rapidly in water have a tendency to lose their shape and are reduced to small pieces if allowed to boil long enough.", "Many recipes for pork ribs call for parboiling them before cooking, but this method is not recommended, as water is a solvent and may wash away flavors."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ABraising", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Braising", "url": "https://en.wikibooks.org/wiki/Cookbook%3ABraising", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Braising", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Cooking techniques", "Braising (from the French word braiser ) is a cooking technique that uses a mixture of dry and wet heats. First, the food is sautéed in a fat, charring it and sealing in flavour. Then the food is simmered slowly with a small amount of liquid which results in tender, flavourful food.", "Braising relies on heat, time, and moisture to successfully break down tough connective tissue and collagens in meat. It is an ideal way to cook tougher cuts. Many classic braised dishes such as Coq au Vin are highly-evolved methods of cooking otherwise tough and unpalatable foods.  Swissing, stewing and pot-roasting are all braising types.", "Most braises follow the same basic steps. The meat or poultry is first browned in hot fat.  Aromatic vegetables are sometimes then browned as well. A cooking liquid that often includes an acidic element, such as tomatoes or wine, is added to the pot, which is covered. The dish cooks in relatively low heat in an oven or atop the stove until the meat is fork-tender. Often the cooking liquid is finished to create a sauce or gravy.", "A successful braise intermingles the flavors of the foods being cooked and the cooking liquid. Also, the dissolved collagens and gelatins from the meat enrich and add body to the liquid. Braising is economical, as it allows the use of tough and inexpensive cuts, and efficient, as it often employs a single pot to cook an entire meal.", "Familiar braised dishes include Murshed, pot roast, beef stew, Swiss steak, chicken cacciatore, goulash, braised tilapia and beef bourguignon, among others. Braising is also used extensively in the cuisines of Asia, particularly Chinese cuisine. Vegetables can also be braised.  Glazed carrots are an example of a quick-braise, one which is done for a short period of time."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ABroiling", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Broiling", "url": "https://en.wikibooks.org/wiki/Cookbook%3ABroiling", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Broiling", "ingredients": [], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Cooking techniques", "Broiling or Grilling is the use of radiant heat for cooking, usually called grilling in British and Australian English and broiling in US English. Typically this is done in an electric oven , using only the upper heating element, with the door partially open. Gas ovens often provide a  very effective lower drawer for broiling.  Gas ovens, in a way analogous to gas ranges, provide a hotter, flame-based heat source that is preferred by most cooks over electric broilers.  This is where the term \"flame broiled\" comes from.", "Broiling is used to retain the juices of meat while developing flavor. Broiling does not soften the fibers of tough meat. It is best used for tender meat, including poultry . Broiling is not the most economical way of cooking, and the browning of meat can create carcinogenic (albeit tasty) chemicals.", "The food should be exposed to intense heat last, to ensure even cooking and less juice escaping. How does that work? Heat damages surface proteins that keep the juice in. The higher the heat, the more damage. So, contrary to popular belief, searing before cooking through will NOT lock in the juices. The food that is being broiled should be turned just once. Once the outside is browned, the heat may need to be reduced to ensure that the center will cook before the outside burns."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ACanning", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Canning", "url": "https://en.wikibooks.org/wiki/Cookbook%3ACanning", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Canning", "ingredients": ["Two-piece lid mason jars. Wide-mouth style on the left and regular mouth to the right.", "Single-piece jar (lug thread)", "Weck-type jars and lids", "Bail-style jar (not recommended)"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Cooking techniques", "Canning is a method of preservation that sterilizes and seals food in airtight containers.", "The ultimate purpose of canning is to preserve the safety and quality of foods for an extended period of time at ambient temperature. Several types of spoilage can happen to foods over time. The first—simple discoloration and the development of off-flavors—is relatively harmless but typically still undesirable. These issues are commonly caused by enzymatic activity and exposure to ambient oxygen in the environment. [ 1 ] A more concerning type of spoilage involves the growth of microbes that, if consumed, can cause significant illness. These include 'bad' molds and bacteria, [ 1 ] the former of which is generally visibly apparent, and the latter of which can be harder to detect. Mold takes a little while to grow, but bacteria can grow very rapidly—on the order of hours—and colonize contaminated food. [ 2 ] Conditions favorable to this kind of spoilage include moist, nutrient-rich environments at ambient temperature. [ 1 ]", "One of the most dangerous types of spoilage, especially with respect to canning, is botulism. [ 2 ] Spores of Clostridium botulinum bacteria are widely present in the environment, including in agricultural products, and they normally pose little to no danger to healthy adults. [ 3 ] However, when the spores are left in a moist, low-oxygen, low-acid environment around ambient temperature (all conditions sometimes found in canned or other foods), [ 2 ] [ 3 ] they quickly multiply and produce a very potent and dangerous neurotoxin that can be rapidly fatal if ingested. [ 3 ]", "To prevent moisture loss and off-flavors, it is simple enough to seal foods in a jar with little to no air, but this doesn't address microbial spoilage. Currently, the two components used in canning to prevent such microbial spoilage are heat and acidity. Boiling food for a prescribed amount of time (specific to a given recipe and altitude) is usually sufficient to kill most spoilage bacteria and molds (e.g. Campylobacter , Listeria , Salmonella , yeast etc). [ 2 ] [ 4 ] However, it is very difficult to kill botulism spores at the temperatures achieved by boiling—it would take hours and hours of continuous boiling to do so, [ 3 ] which is not feasible for reasons of both practicality final food quality. If you want to destroy botulism spores, you must use a pressure canner to achieve high enough temperatures (upwards of 240–250°F/115–121°C) that will eliminate them in a reasonable time frame. [ 2 ] [ 3 ] [ 5 ] [ 6 ] [ 7 ]", "Now, with acidic-enough foods, it is possible to eliminate the danger of botulism with just boiling water and not a pressure canner. [ 2 ] [ 8 ] Because the botulism bacteria cannot grow in a high-acid environment (i.e. uniformly and well below a pH of 4.6 throughout the food), [ 4 ] it does not matter if the spores are not destroyed; the bacteria cannot grow and produce the botulinum toxin. [ 4 ] [ 9 ] Note, still, that other spoilage microbes aside from botulism bacteria are not inhibited by the same acidic conditions alone, which is why acidic foods must still be processed in boiling water. [ 4 ] And, heating the jars can help drive acidity into the individual components of a mixture, ensuring even acidity throughout. [ 4 ] Furthermore, growth of some other microbes can reduce the acidity of their environment and make a food vulnerable to botulism even if it started off acidic enough to confer protection. Some unreliable sources may say that botulism bacteria growth can be prevented with sufficient sugar or salt, but this is incorrect with the concentrations of sugar in salt used in canned prepared foods. [ 10 ] While high sugar and salt can suppress some microbial growth at the concentrations used in some preparations, they do not protect against all microbial growth, and least of all botulism. [ 11 ]", "Generally, foods to be canned are classified as low-acid or high-acid. Examples of low-acid foods are most fresh vegetables, dairy, meats, and seafood, as well as products made with these. [ 2 ] [ 3 ] [ 5 ] [ 12 ] Examples of high-acid foods, which can usually be boiling water-canned, include many (but not all) fruits, fermented pickles, and fruit preserves (e.g. jams and jellies). [ 2 ] [ 3 ] [ 13 ] [ 14 ] In some low-acid foods, recipes call for them to be acidified—that is, they have acid added to them (often in the form of lemon juice, citric acid, or vinegar) to bring them to safe levels. [ 3 ] Common examples include figs, tomatoes, tomato sauces, and salsas. [ 3 ] Interestingly, though tomatoes are commonly thought of as acidic, there is enough variation among them to require acidification for ensured safety. [ 2 ] [ 3 ]", "According to the USDA, one way to destroy existing botulism toxin and make it less dangerous is to boil food for 10 minutes below 1,000 ft of altitude, adding an additional minute per 1,000 ft above that point; [ 3 ] however, this should not be construed as a recommendation to consume foods you suspect to be contaminated with botulism. Rather, it is for harm reduction purposes only."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3ADeep_Fat_Frying", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Deep Fat Frying", "url": "https://en.wikibooks.org/wiki/Cookbook%3ADeep_Fat_Frying", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Deep Fat Frying", "ingredients": ["Turn off your deep fryer, and allow the oil to cool.", "It is likely not acutely dangerous – the fire point and kindling point are generally significantly higher than the smoke point, so the oil will not ignite without further heating – but it is extremely hot, and smoke is a warning sign.", "Next time, use a lower temperature setting or choose an oil with a higher smoke point ."], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Cooking techniques | Frying", "Deep frying involves fully immersing food in hot oil . It is an extremely fast cooking method, and, despite the use of liquid oil , is best classified as a dry cooking method because it does not involve liquid water.", "With a deep fat fryer, deep frying is reasonably safe, but hot cooking oil is intrinsically dangerous, and one should be very careful so as to avoid fires and/or severe burns.", "Deep frying does not actually make the food greasy if it is done properly. The water in the food repels the oil. However, the hot oil also boils the water within the food, and steams the food from the inside out. As long as the oil is hot enough and the food is not immersed in the oil for too long, no oil will enter the food itself. If the food stays in the oil too long, the water will steam out and the oil will penetrate the food. If the oil is too cool, the food won't be done before this happens.", "Most fried recipes rely on either a coating of batter or breading, or on foods that have or produce a natural skin around the food such as potatoes or whole poultry with the skin on. The effect of this is that the outside of the food becomes crispy and browned while the inside is tender, moist, and steamed, similar to searing. Of course, the batter can absorb huge amounts of fat and is usually consumed along with the food, causing the total fat content ingested to increase tremendously.", "Chip pans can be dangerous and should only be used with caution and when continuously supervised, preferably with a thermometer; deep fryers are safer. Chip pans are the leading cause of house fires in the UK, and further, may spill hot oil, causing severe burns. If you have a chip pan, your local fire brigade may offer to trade it in for a deep fryer, or can otherwise advise about the dangers.", "When the oil starts to give off continuous smoke, you have it far too hot – it is at the smoke point , and the oil becomes carcinogenic at this point.", "In case of fire, call the fire department immediately."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
{"source": "wikibooks", "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AFermentation", "license": "CC BY-SA 3.0", "attribution": {"project": "Wikibooks", "title": "Cookbook:Fermentation", "url": "https://en.wikibooks.org/wiki/Cookbook%3AFermentation", "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."}, "recipe": {"title": "Cookbook:Fermentation", "ingredients": ["Tastes different, bringing new, often strong flavours to the source foods", "Is easier to digest", "Is more nutritious", "Lasts longer"], "steps": ["Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages | Cooking techniques", "Fermentation is the process of controlling bacteria, yeast, and molds to modify food, producing a desired product.", "Fermentation can improve food so that it:", "As with any food preparation, there are certain aspects of the fermentation process that can change the quality and acceptability of the end product. Here are some of the important ones that are generally applicable; check individual recipes for special tips and variations.", "Selecting good quality ingredients is important when fermenting food. It doesn't generally matter if the ingredients aren't picture perfect – cider vinegar won't look or taste any different for using ugly apples – but avoid using old, rotting, or very dirty food. Remember that a fermentation is where yeast and bacteria are given a chance to multiply, so give your ferment a fighting chance and stick to good quality ingredients.", "Many ferments use salt . Salt helps by inhibiting undesirable bacteria and molds, and by drawing juices out of foods. It is best to use a salt that has no anti-caking agents or iodine added to it, as these can inhibit the fermentation and growth of desirable bacteria. Iodine is an effective antibacterial agent, and even the very small amounts used in iodised salt can affect the bacterial growth. Salt suitable for fermenting is often called \"pickling salt\" or \"Kosher salt\".", "When adding water to a fermentation, avoid chlorinated water if possible. Chlorine is added to municipal water supplies to prevent the build-up of bacteria and other water-borne microorganisms, and as such can inhibit a fermentation.", "Tap water can be made chlorine-free in most areas simply by boiling it and letting it cool again, or even just by leaving it in an uncovered pot overnight. This doesn't work in areas where the water is chlorinated by adding chloramine to the water, a practice done specifically to keep the chlorine in the water. Many modern water filters will remove both chlorine and chloramine, however."], "servings": null, "cook_time_minutes": null, "cuisine": null, "tools": null}}
