{
  "source": "wikibooks",
  "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AFood_Safety_and_Sanitation",
  "license": "CC BY-SA 3.0",
  "attribution": {
    "project": "Wikibooks",
    "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Food Safety and Sanitation</span>",
    "url": "https://en.wikibooks.org/wiki/Cookbook%3AFood_Safety_and_Sanitation",
    "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."
  },
  "recipe": {
    "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Food Safety and Sanitation</span>",
    "ingredients": [],
    "steps": [
      "Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages",
      "Foodborne illness usually arises from improper handling, preparation, or storage of food. Good hygiene practices before, during, and after food preparation can reduce the chances of contracting an illness. There is a consensus in the public health community that regular hand-washing is one of the most effective defenses against the spread of foodborne illness. The action of monitoring food to ensure that it will not cause foodborne illness is known as food safety. Foodborne disease can also be caused by a large variety of toxins that affect the environment. Furthermore, foodborne illness can be caused by pesticides or medicines in food and natural toxic substances such as poisonous mushrooms or reef fish.",
      "Bacteria are a common cause of foodborne illness. The United Kingdom, in 2000, reported the individual bacteria involved as the following: Campylobacter jejuni 77.3%, Salmonella 20.9%, Escherichia coli O157:H7 1.4%, and all others less than 0.56%. In the past, bacterial infections were thought to be more prevalent because few places had the capability to test for norovirus and no active surveillance was being done for this particular agent. Toxins from bacterial infections are delayed because the bacteria need time to multiply. As a result, symptoms associated with intoxication are usually not seen until 12–72 hours or more after eating contaminated food. However, in some cases, such as Staphylococcal food poisoning, the onset of illness can be as soon as 30 minutes after ingesting contaminated food.",
      "Viral infections make up perhaps one third of cases of food poisoning in developed countries. In the US, more than 50% of cases are viral and noroviruses are the most common foodborne illness, causing 57% of outbreaks in 2004. Foodborne viral infection are usually of intermediate (1–3 days) incubation period, causing illnesses which are self-limited in otherwise healthy individuals; they are similar to the bacterial forms described above.",
      "The impact of chemical contaminants on consumer health and well-being is often apparent only after many years of processing and prolonged exposure at low levels (e.g., cancer). Unlike food-borne pathogens, chemical contaminants present in foods are often unaffected by thermal processing. Chemical contaminants can be classified according to the source of contamination and the mechanism by which they enter the food product.",
      "Agrochemicals are chemicals used in agricultural practices and animal husbandry with the intent to increase crop yields.",
      "Environmental contaminants are chemicals that are present in the environment in which the food is grown, harvested, transported, stored, packaged, processed, and consumed. The physical contact of the food with its environment results in its contamination.",
      "At home, prevention mainly consists of good food safety practices. Many forms of bacterial poisoning can be prevented by cooking food sufficiently, and either eating it quickly or refrigerating it effectively. Many toxins, however, are not destroyed by heat treatment. Techniques that help prevent food borne illness in the kitchen are hand washing, rinsing produce, preventing cross-contamination, proper storage, and maintaining cooking temperatures. In general, freezing or refrigerating prevents virtually all bacteria from growing, and heating food sufficiently kills parasites, viruses, and most bacteria. Bacteria grow most rapidly at the range of temperatures between 40 and 140 °F (4 and 60 °C), called the \"danger zone\". Storing food below or above the \"danger zone\" can effectively limit the production of toxins. For storing leftovers, the food must be put in shallow containers for quick cooling and must be refrigerated within two hours. When food is reheated, it must reach an internal temperature of 165 °F (74 °C) or until hot or steaming to kill bacteria."
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": null,
    "tools": null
  }
}