{
  "source": "wikibooks",
  "source_url": "https://en.wikibooks.org/wiki/Cookbook%3AAppetizers",
  "license": "CC BY-SA 3.0",
  "attribution": {
    "project": "Wikibooks",
    "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Appetizers</span>",
    "url": "https://en.wikibooks.org/wiki/Cookbook%3AAppetizers",
    "notice": "Text available under CC BY-SA 3.0; attribution and share-alike required."
  },
  "recipe": {
    "title": "<span class=\"mw-page-title-namespace\">Cookbook</span><span class=\"mw-page-title-separator\">:</span><span class=\"mw-page-title-main\">Appetizers</span>",
    "ingredients": [],
    "steps": [
      "Cookbook | Recipes | Ingredients | Equipment | Techniques | Cookbook Disambiguation Pages",
      "Appetizers are dishes served before a meal or at a cocktail party or other informal occasion.  They are often referred to as snacks or hors d' oeuvres .",
      "In general, appetizers are intended to be eaten by hand in a bite or two, or at least be capable of being cut with the side of a fork, rather than a knife.  Since appetizers are a customary course in French and Italian cooking, among other styles of cooking, it is fairly easy to find haute cuisine recipes for appetizers.",
      "Arguably, one fundamental, unspoken, purpose of appetizers, especially in a restaurant setting, is to keep hungry people fed until the main dish is served.",
      "In a home setting, people who might have trouble getting the main meal on the table in a timely fashion on a particular day, such as a holiday, might especially want to have planned in advance to serve an appetizer of some type or sort.",
      "One of the most fundamental appetizer categories in modern times, ignoring haute cuisine, is the dip and carrier combination, of which the variations are endless.",
      "For a complete, automatically generated list of recipes, see Category:Appetizer recipes , or browse the subcategories below."
    ],
    "servings": null,
    "cook_time_minutes": null,
    "cuisine": null,
    "tools": null
  }
}